 { "code_civil" : {
    "livres":[
      {
      "livre": "Livre I : Des personnes",
      "structure": [
      {
        "titre": "Titre I : Des personnes physiques",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : De l’existence civile",
            "articles" : [
              {
                "article": "Article 1",
                "explication": "Toute personne humaine jouit de la personnalité juridique dès sa naissance vivante. La personnalité juridique confère des droits civils, notamment le droit à un nom, à une nationalité, et à une protection légale."
              },
              {
                "article": "Article 2",
                "explication": "La capacité est définie comme la faculté de jouir et d'exercer des droits. Elle se divise en capacité de jouissance (droits) et capacité d'exercice (actes)."
              },
              {
                "article": "Article 3",
                "explication": "Les mineurs et les majeurs protégés sont soumis à des incapacités spéciales. Les mineurs nécessitent une assistance légale, tandis que les majeurs protégés peuvent être placés sous tutelle ou curatelle."
              },
              {
                "article": "Article 4",
                "explication": "Les personnes handicapées jouissent des mêmes droits que toute autre personne. Des mesures spécifiques sont prévues pour leur garantir l'accès à l'état civil et aux services publics (Loi n°2010/002)."
              },
              {
                "article": "Article 5",
                "explication": "La disparition prolongée d'une personne peut être déclarée par un tribunal après une enquête approfondie."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : De la capacité",
            "sections": [
              {
                "section": "Section 1 : Capacité générale",
                "articles": [
                  {
                    "article": "Article 6",
                    "explication": "La capacité générale est définie comme l'aptitude à jouir et exercer des droits. Toute personne physique est présumée capable sauf exception (mineurs, incapables)."
                  },
                  {
                    "article": "Article 7",
                    "explication": "Les personnes qui ont perdu leur discernement (maladie mentale, démence) peuvent être placées sous sauvegarde de justice."
                  }
                ]
              },
              {
                "section": "Section 2 : Incapacités spéciales",
                "articles": [
                  {
                    "article": "Article 8",
                    "explication": "Les mineurs sont protégés par la loi contre les actes juridiques qu'ils ne peuvent pas comprendre. Exemple : un mineur ne peut pas vendre un bien immobilier sans autorisation parentale."
                  },
                  {
                    "article": "Article 9",
                    "explication": "Les majeurs protégés sont ceux qui ont perdu leur discernement. Ils peuvent être placés sous sauvegarde de justice, curatelle ou tutelle."
                  },
                  {
                    "article": "Article 10",
                    "explication": "Une personne victime de violence conjugale peut demander une ordonnance de protection auprès des tribunaux pour assurer sa sécurité (Loi n°2011/024)."
                  }
                ]
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : De l’état civil",
            "sections": [
              {
                "section": "Section 1 : Du nom",
                "articles": [
                  {
                    "article": "Article 11",
                    "explication": "Chaque personne a le droit à un nom inscrit sur son acte de naissance. Le nom peut être modifié par décision judiciaire dans des cas exceptionnels (ex. : adoption)."
                  },
                  {
                    "article": "Article 12",
                    "explication": "Le changement de nom peut être accordé pour des raisons graves, telles que la discrimination ou la stigmatisation sociale."
                  }
                ]
              },
              {
                "section": "Section 2 : Du domicile",
                "articles": [
                  {
                    "article": "Article 13",
                    "explication": "Le domicile est le lieu où une personne a son principal établissement. Il détermine la compétence des tribunaux et l'application de certaines lois."
                  },
                  {
                    "article": "Article 14",
                    "explication": "Le domicile légal des mineurs est celui de leurs parents ou tuteurs légaux."
                  }
                ]
              },
              {
                "section": "Section 3 : De la nationalité",
                "articles": [
                  {
                    "article": "Article 15",
                    "explication": "La nationalité camerounaise peut être acquise par naissance sur le territoire (droit du sol), filiation (droit du sang), ou naturalisation."
                  },
                  {
                    "article": "Article 16",
                    "explication": "La nationalité peut être perdue par renonciation volontaire ou décision judiciaire (ex. : fraude)."
                  },
                  {
                    "article": "Article 17",
                    "explication": "Un enfant né au Cameroun de parents étrangers peut acquérir la nationalité camerounaise s'il y réside continuellement jusqu'à sa majorité."
                  }
                ]
              }
            ]
          },
          {
            "chapitre": "Chapitre 4 : De la disparition et de la mort",
            "sections": [
              {
                "section": "Section 1 : Disparition",
                "articles": [
                  {
                    "article": "Article 18",
                    "explication": "Si une personne disparaît pendant une longue période, elle peut être déclarée absente par un tribunal. Ses biens sont alors gérés par un administrateur provisoire."
                  },
                  {
                    "article": "Article 19",
                    "explication": "L'absence prolongée peut entraîner la présomption de décès après une période légale de recherche infructueuse."
                  }
                ]
              },
              {
                "section": "Section 2 : Mort",
                "articles": [
                  {
                    "article": "Article 20",
                    "explication": "La mort est prouvée par un certificat médical ou une enquête judiciaire. En cas de décès simultané (ex. : accident), la présomption de survivance s'applique."
                  },
                  {
                    "article": "Article 21",
                    "explication": "En cas de décès, les biens du défunt sont transmis selon les règles de succession légale ou testamentaire."
                  }
                ]
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre II : Des personnes morales",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Dispositions générales",
            "articles": [
              {
                "article": "Article 22",
                "explication": "Les personnes morales sont des entités distinctes des personnes physiques (ex. : associations, sociétés). Elles doivent être créées selon des procédures légales (enregistrement, reconnaissance)."
              },
              {
                "article": "Article 23",
                "explication": "Les personnes morales ont une capacité juridique limitée à leur objet social (ex. : une association caritative ne peut pas vendre des armes)."
              },
              {
                "article": "Article 24",
                "explication": "Les personnes morales peuvent être dissoutes volontairement ou par décision judiciaire en cas de violation des lois."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Des associations",
            "articles": [
              {
                "article": "Article 25",
                "explication": "Les associations doivent être enregistrées auprès des autorités compétentes. Elles doivent avoir un objet licite et moral."
              },
              {
                "article": "Article 26",
                "explication": "Une association peut être dissoute par décision de ses membres ou par décision judiciaire (ex. : activités illégales)."
              },
              {
                "article": "Article 27",
                "explication": "Les associations reconnues d'utilité publique bénéficient de privilèges fiscaux et administratifs."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : Des sociétés",
            "articles": [
              {
                "article": "Article 28",
                "explication": "Les sociétés peuvent être civiles (non commerciales) ou commerciales. Exemples : SARL, SA, coopératives."
              },
              {
                "article": "Article 29",
                "explication": "Les sociétés doivent être constituées selon des règles spécifiques (statuts, capital minimum)."
              },
              {
                "article": "Article 30",
                "explication": "Les associés d'une société sont responsables des dettes sociales selon les modalités définies dans les statuts."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre III : De la famille",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Du mariage",
            "sections": [
              {
                "section": "Section 1 : Conditions du mariage",
                "articles": [
                  {
                    "article": "Article 31",
                    "explication": "L'âge minimum pour se marier est de 18 ans pour tous, filles et garçons (réforme 2016). Exception : dispense possible pour raisons graves."
                  },
                  {
                    "article": "Article 32",
                    "explication": "Le mariage nécessite le consentement libre et éclairé des deux époux. Tout mariage forcé est nul."
                  }
                ]
              },
              {
                "section": "Section 2 : Forme du mariage",
                "articles": [
                  {
                    "article": "Article 33",
                    "explication": "Tout mariage doit être célébré devant un officier d'état civil. Reconnaissance conditionnelle des mariages coutumiers et religieux."
                  },
                  {
                    "article": "Article 34",
                    "explication": "Les mariages polygames ne sont reconnus que s'ils respectent les conditions légales applicables."
                  }
                ]
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Du divorce",
            "articles": [
              {
                "article": "Article 35",
                "explication": "Causes : divorce par consentement mutuel, pour faute (adultère, violence), ou pour altération définitive du lien conjugal."
              },
              {
                "article": "Article 36",
                "explication": "Le divorce est prononcé par un tribunal. Liquidation des biens communs."
              },
              {
                "article": "Article 37",
                "explication": "En cas de divorce, le conjoint victime de violence conjugale peut bénéficier d'une pension alimentaire majorée (Loi n°2011/024)."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : De la filiation",
            "articles": [
              {
                "article": "Article 38",
                "explication": "Enfants nés dans le mariage. Présomption de paternité."
              },
              {
                "article": "Article 39",
                "explication": "Reconnaissance volontaire ou judiciaire."
              },
              {
                "article": "Article 40",
                "explication": "Les enfants adoptés jouissent des mêmes droits que les enfants biologiques, y compris en matière de succession."
              }
            ]
          },
          {
            "chapitre": "Chapitre 4 : De l’autorité parentale",
            "articles": [
              {
                "article": "Article 41",
                "explication": "Obligation d’entretien, d’éducation, et de protection des enfants."
              },
              {
                "article": "Article 42",
                "explication": "Mesures de protection pour les enfants privés de parents."
              },
              {
                "article": "Article 43",
                "explication": "Les parents doivent garantir une éducation non discriminatoire et respectueuse des droits de l'enfant (Convention des droits de l'enfant, intégrée dans le droit camerounais)."
              }
            ]
          },





          {
            "chapitre": "Chapitre 5 : Des droits des époux",
            "articles": [
              {
                "article": "Article 44",
                "explication": "Les époux ont des droits et devoirs réciproques, notamment le respect mutuel, l'entraide, et la fidélité."
              },
              {
                "article": "Article 45",
                "explication": "Le régime matrimonial détermine la gestion des biens entre époux (communauté, séparation de biens, etc.)."
              },
              {
                "article": "Article 46",
                "explication": "Les époux peuvent modifier leur régime matrimonial par acte notarié après autorisation judiciaire."
              }
            ]
          },
          {
            "chapitre": "Chapitre 6 : Des enfants dans le mariage",
            "articles": [
              {
                "article": "Article 47",
                "explication": "Les enfants nés dans le mariage sont présumés être ceux des deux époux."
              },
              {
                "article": "Article 48",
                "explication": "Les parents doivent assurer l'éducation, la santé, et le bien-être de leurs enfants."
              },
              {
                "article": "Article 49",
                "explication": "Les enfants ont le droit d'être élevés sans discrimination et dans le respect de leur dignité."
              }
            ]
          },
          {
            "chapitre": "Chapitre 7 : Des enfants hors mariage",
            "articles": [
              {
                "article": "Article 50",
                "explication": "Les enfants nés hors mariage jouissent des mêmes droits que ceux nés dans le mariage, y compris en matière de filiation."
              },
              {
                "article": "Article 51",
                "explication": "La reconnaissance volontaire ou judiciaire permet d'établir la filiation des enfants naturels."
              },
              {
                "article": "Article 52",
                "explication": "Les pères biologiques des enfants naturels ont l'obligation légale de contribuer à leur entretien."
              }
            ]
          },
          {
            "chapitre": "Chapitre 8 : De l'adoption",
            "articles": [
              {
                "article": "Article 53",
                "explication": "L'adoption est un acte juridique qui crée un lien de filiation entre l'adoptant et l'adopté."
              },
              {
                "article": "Article 54",
                "explication": "L'adoption peut être simple ou plénière, selon les conditions fixées par la loi."
              },
              {
                "article": "Article 55",
                "explication": "L'adopté acquiert les mêmes droits que les enfants biologiques, y compris en matière de succession."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre IV : Des droits de la personnalité",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Droits fondamentaux",
            "articles": [
              {
                "article": "Article 56",
                "explication": "Toute personne a droit au respect de sa vie privée, de son image, et de sa réputation."
              },
              {
                "article": "Article 57",
                "explication": "Nul ne peut être privé arbitrairement de sa liberté ou de ses droits civils."
              },
              {
                "article": "Article 58",
                "explication": "Les atteintes aux droits de la personnalité peuvent donner lieu à des sanctions pénales ou civiles."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Protection des mineurs",
            "articles": [
              {
                "article": "Article 59",
                "explication": "Les mineurs bénéficient d'une protection spéciale contre toute forme d'exploitation ou de violence."
              },
              {
                "article": "Article 60",
                "explication": "Les parents ou tuteurs légaux doivent veiller à la sécurité et au bien-être des mineurs."
              },
              {
                "article": "Article 61",
                "explication": "Les mineurs victimes de violences physiques ou psychologiques peuvent bénéficier d'une assistance judiciaire."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : Protection des personnes handicapées",
            "articles": [
              {
                "article": "Article 62",
                "explication": "Les personnes handicapées ont droit à une égalité de traitement et à une protection spéciale contre toute forme de discrimination."
              },
              {
                "article": "Article 63",
                "explication": "L'État doit garantir l'accès des personnes handicapées aux services publics, à l'éducation, et à l'emploi."
              },
              {
                "article": "Article 64",
                "explication": "Les personnes handicapées peuvent demander une assistance juridique gratuite en cas de besoin."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre V : Dispositions diverses",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Des conventions matrimoniales",
            "articles": [
              {
                "article": "Article 65",
                "explication": "Les futurs époux peuvent conclure un contrat de mariage avant le mariage pour organiser leur régime matrimonial."
              },
              {
                "article": "Article 66",
                "explication": "Les conventions matrimoniales doivent être établies par acte notarié et enregistrées auprès des autorités compétentes."
              },
              {
                "article": "Article 67",
                "explication": "Les clauses contraires à l'ordre public ou aux bonnes mœurs sont nulles."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Des donations entre époux",
            "articles": [
              {
                "article": "Article 68",
                "explication": "Les époux peuvent se faire des donations entre vifs ou par testament, sous réserve des droits réservataires."
              },
              {
                "article": "Article 69",
                "explication": "Les donations entre époux doivent être constatées par acte authentique pour être valides."
              },
              {
                "article": "Article 70",
                "explication": "Les donations excessives peuvent être réduites pour protéger les droits des héritiers réservataires."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : Des successions ab intestat",
            "articles": [
              {
                "article": "Article 71",
                "explication": "En l'absence de testament, les biens du défunt sont répartis selon les règles de la succession légale."
              },
              {
                "article": "Article 72",
                "explication": "Les héritiers réservataires (conjoint, enfants) ont droit à une part minimale des biens du défunt."
              },
              {
                "article": "Article 73",
                "explication": "Les collatéraux (frères, sœurs, cousins) ne peuvent hériter qu'en l'absence d'héritiers directs."
              }
            ]
          },



          {
            "chapitre": "Chapitre 4 : Des droits numériques",
            "articles": [
              {
                "article": "Article 74",
                "explication": "Toute personne a droit à la protection de ses données personnelles sur Internet."
              },
              {
                "article": "Article 75",
                "explication": "Les violations des données personnelles peuvent entraîner des sanctions pénales ou civiles."
              },
              {
                "article": "Article 76",
                "explication": "Les plateformes numériques doivent garantir la confidentialité des informations collectées auprès des utilisateurs."
              }
            ]
          },
          {
            "chapitre": "Chapitre 5 : Des personnes âgées",
            "articles": [
              {
                "article": "Article 77",
                "explication": "Les personnes âgées ont droit à une protection spéciale contre toute forme de négligence ou d'abus."
              },
              {
                "article": "Article 78",
                "explication": "L'État doit garantir l'accès des personnes âgées aux soins de santé et aux pensions sociales."
              },
              {
                "article": "Article 79",
                "explication": "Les familles sont responsables de l'entretien et de la protection des personnes âgées dépendantes."
              }
            ]
          },
          {
            "chapitre": "Chapitre 6 : Des droits extrapatrimoniaux",
            "articles": [
              {
                "article": "Article 80",
                "explication": "Le droit à l'image est protégé par la loi, et toute utilisation non autorisée peut donner lieu à des poursuites."
              },
              {
                "article": "Article 81",
                "explication": "Le respect de la vie privée est un droit fondamental, et toute intrusion illégale est sanctionnée."
              },
              {
                "article": "Article 82",
                "explication": "La diffamation ou l'injure publique peut entraîner des sanctions civiles ou pénales."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre VI : De la responsabilité civile",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Principes généraux",
            "articles": [
              {
                "article": "Article 83",
                "explication": "Toute personne qui cause un dommage à autrui est tenue de le réparer, sauf s'il prouve qu'il n'y a pas eu faute."
              },
              {
                "article": "Article 84",
                "explication": "La réparation du dommage peut inclure des indemnités pour préjudice matériel ou moral."
              },
              {
                "article": "Article 85",
                "explication": "Les parents sont responsables des dommages causés par leurs enfants mineurs sous leur garde."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Responsabilité parentale",
            "articles": [
              {
                "article": "Article 86",
                "explication": "Les parents sont responsables des actes de leurs enfants mineurs jusqu'à ce qu'ils atteignent l'âge de majorité."
              },
              {
                "article": "Article 87",
                "explication": "Les tuteurs légaux sont également responsables des actes des mineurs placés sous leur tutelle."
              },
              {
                "article": "Article 88",
                "explication": "En cas de faute grave, les parents peuvent être déchus de leur autorité parentale."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : Responsabilité professionnelle",
            "articles": [
              {
                "article": "Article 89",
                "explication": "Les professionnels (médecins, avocats, ingénieurs) sont responsables des dommages causés par leur négligence ou imprudence."
              },
              {
                "article": "Article 90",
                "explication": "Les employeurs sont responsables des dommages causés par leurs employés dans l'exercice de leurs fonctions."
              },
              {
                "article": "Article 91",
                "explication": "Les contrats professionnels doivent inclure des clauses de responsabilité pour protéger les parties."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre VII : Des obligations alimentaires",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Obligation entre époux",
            "articles": [
              {
                "article": "Article 92",
                "explication": "Les époux ont l'obligation mutuelle de se soutenir financièrement pendant le mariage."
              },
              {
                "article": "Article 93",
                "explication": "En cas de divorce, l'époux économiquement désavantagé peut demander une pension alimentaire."
              },
              {
                "article": "Article 94",
                "explication": "La pension alimentaire est fixée en fonction des ressources et des besoins des parties."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Obligation envers les enfants",
            "articles": [
              {
                "article": "Article 95",
                "explication": "Les parents ont l'obligation légale de subvenir aux besoins de leurs enfants jusqu'à leur majorité."
              },
              {
                "article": "Article 96",
                "explication": "Les enfants majeurs peuvent demander une contribution parentale s'ils poursuivent des études supérieures."
              },
              {
                "article": "Article 97",
                "explication": "Les pères biologiques d'enfants naturels sont également tenus de contribuer à leur entretien."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : Obligation envers les ascendants",
            "articles": [
              {
                "article": "Article 98",
                "explication": "Les enfants ont l'obligation morale et légale de prendre soin de leurs parents âgés ou dépendants."
              },
              {
                "article": "Article 99",
                "explication": "En cas de refus, les tribunaux peuvent ordonner une contribution financière obligatoire."
              },
              {
                "article": "Article 100",
                "explication": "Les petits-enfants peuvent être appelés à subvenir aux besoins de leurs grands-parents si leurs parents ne peuvent pas le faire."
              }
            ]
          },



          {
            "chapitre": "Chapitre 4 : Des successions testamentaires",
            "articles": [
              {
                "article": "Article 101",
                "explication": "Un testament peut être olographe, authentique ou mystique."
              },
              {
                "article": "Article 102",
                "explication": "Les testaments doivent respecter les règles formelles pour être valides."
              },
              {
                "article": "Article 103",
                "explication": "Les legs excessifs peuvent être réduits pour protéger les héritiers réservataires."
              },
              {
                "article": "Article 104",
                "explication": "Un testament peut être modifié ou révoqué par son auteur à tout moment."
              },
              {
                "article": "Article 105",
                "explication": "En cas de pluralité de testaments, seul le dernier valide est pris en compte."
              }
            ]
          },
          {
            "chapitre": "Chapitre 5 : Des donations entre vifs",
            "articles": [
              {
                "article": "Article 106",
                "explication": "Les donations entre vifs doivent être constatées par acte authentique pour être valides."
              },
              {
                "article": "Article 107",
                "explication": "Les donations peuvent être révoquées en cas d'ingratitude du donataire."
              },
              {
                "article": "Article 108",
                "explication": "Les donations excessives peuvent être réduites pour protéger les droits des héritiers réservataires."
              },
              {
                "article": "Article 109",
                "explication": "Les donations avec charge doivent être exécutées selon les conditions fixées par le donateur."
              },
              {
                "article": "Article 110",
                "explication": "Les donations peuvent inclure des biens meubles ou immeubles, mais doivent respecter les droits des tiers."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre VIII : Des servitudes",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Servitudes légales",
            "articles": [
              {
                "article": "Article 111",
                "explication": "Les servitudes légales concernent les droits d'accès, de passage, et d'eau."
              },
              {
                "article": "Article 112",
                "explication": "Les servitudes légales sont imposées par la loi pour garantir un usage raisonnable des biens."
              },
              {
                "article": "Article 113",
                "explication": "Les servitudes légales ne peuvent être supprimées sans autorisation judiciaire."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Servitudes volontaires",
            "articles": [
              {
                "article": "Article 114",
                "explication": "Les servitudes volontaires sont établies par contrat entre propriétaires."
              },
              {
                "article": "Article 115",
                "explication": "Les servitudes volontaires doivent être constatées par écrit pour être opposables."
              },
              {
                "article": "Article 116",
                "explication": "Les servitudes volontaires cessent en cas de renonciation ou de disparition de leur objet."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre IX : Des biens immatériels",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Propriété intellectuelle",
            "articles": [
              {
                "article": "Article 117",
                "explication": "Les biens immatériels incluent les droits d'auteur, les brevets, et les marques."
              },
              {
                "article": "Article 118",
                "explication": "Les créateurs de biens immatériels bénéficient d'une protection légale contre toute contrefaçon."
              },
              {
                "article": "Article 119",
                "explication": "Les droits sur les biens immatériels peuvent être transmis par succession ou vente."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Droits numériques",
            "articles": [
              {
                "article": "Article 120",
                "explication": "Les plateformes numériques doivent garantir la confidentialité des informations collectées auprès des utilisateurs."
              },
              {
                "article": "Article 121",
                "explication": "Les violations des données personnelles peuvent entraîner des sanctions pénales ou civiles."
              },
              {
                "article": "Article 122",
                "explication": "Les utilisateurs ont le droit de demander la suppression de leurs données personnelles."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre X : Des contrats familiaux",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Contrats de mariage",
            "articles": [
              {
                "article": "Article 123",
                "explication": "Les futurs époux peuvent conclure un contrat de mariage avant le mariage pour organiser leur régime matrimonial."
              },
              {
                "article": "Article 124",
                "explication": "Les contrats de mariage doivent être établis par acte notarié et enregistrés auprès des autorités compétentes."
              },
              {
                "article": "Article 125",
                "explication": "Les clauses contraires à l'ordre public ou aux bonnes mœurs dans les contrats de mariage sont nulles."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Contrats de donation",
            "articles": [
              {
                "article": "Article 126",
                "explication": "Les donations entre membres d'une même famille doivent respecter les règles de forme et de fond."
              },
              {
                "article": "Article 127",
                "explication": "Les donations avec charge doivent être exécutées selon les conditions fixées par le donateur."
              },
              {
                "article": "Article 128",
                "explication": "Les donations excessives peuvent être réduites pour protéger les droits des héritiers réservataires."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XI : Des droits des femmes",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Égalité des sexes",
            "articles": [
              {
                "article": "Article 129",
                "explication": "Les femmes jouissent des mêmes droits que les hommes dans tous les domaines, y compris en matière de mariage et de succession."
              },
              {
                "article": "Article 130",
                "explication": "Les violences faites aux femmes sont sanctionnées par des peines pénales et des mesures de protection."
              },
              {
                "article": "Article 131",
                "explication": "Les femmes victimes de violence conjugale peuvent bénéficier d'une ordonnance de protection."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Mariage et divorce",
            "articles": [
              {
                "article": "Article 132",
                "explication": "Le mariage nécessite le consentement libre et éclairé des deux époux. Tout mariage forcé est nul."
              },
              {
                "article": "Article 133",
                "explication": "En cas de divorce, le conjoint économiquement désavantagé peut demander une pension alimentaire."
              },
              {
                "article": "Article 134",
                "explication": "Les femmes ont le droit de participer à la gestion des biens familiaux sur un pied d'égalité."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XII : Dispositions finales",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Adaptations locales",
            "articles": [
              {
                "article": "Article 135",
                "explication": "Les dispositions du Code civil sont adaptées aux réalités culturelles et sociales du Cameroun."
              },
              {
                "article": "Article 136",
                "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
              },
              {
                "article": "Article 137",
                "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Entrée en vigueur",
            "articles": [
              {
                "article": "Article 138",
                "explication": "Le présent Code civil entre en vigueur à la date de sa publication au Journal officiel."
              },
              {
                "article": "Article 139",
                "explication": "Les dispositions antérieures contraires au présent Code sont abrogées."
              },
              {
                "article": "Article 140",
                "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
              }
            ]
          },
          {
            "article": "Article 141",
            "explication": "Les enfants ont droit à une éducation gratuite et obligatoire jusqu'à l'âge de 16 ans."
          },
          {
            "article": "Article 142",
            "explication": "Les enfants victimes de violences physiques ou psychologiques peuvent bénéficier d'une assistance judiciaire."
          },
          {
            "article": "Article 143",
            "explication": "Les parents ou tuteurs légaux doivent veiller à la sécurité et au bien-être des mineurs."
          },
          {
            "article": "Article 144",
            "explication": "Les enfants ont droit à une alimentation, un logement, et des soins médicaux adéquats."
          },
          {
            "article": "Article 145",
            "explication": "Les enfants placés sous tutelle bénéficient d'une protection spéciale contre toute forme d'abus."
          }
        ]
      },
      {
        "chapitre": "Chapitre 4 : Des personnes handicapées",
        "articles": [
          {
            "article": "Article 146",
            "explication": "Les personnes handicapées ont droit à une égalité de traitement et à une protection spéciale contre toute forme de discrimination."
          },
          {
            "article": "Article 147",
            "explication": "L'État doit garantir l'accès des personnes handicapées aux services publics, à l'éducation, et à l'emploi."
          },
          {
            "article": "Article 148",
            "explication": "Les personnes handicapées peuvent demander une assistance juridique gratuite en cas de besoin."
          },
          {
            "article": "Article 149",
            "explication": "Les employeurs sont encouragés à intégrer les personnes handicapées dans leurs effectifs."
          },
          {
            "article": "Article 150",
            "explication": "Les infrastructures publiques doivent être adaptées pour permettre l'accès des personnes handicapées."
          }
        ]
      },
      {
        "chapitre": "Chapitre 5 : Des droits patrimoniaux",
        "articles": [
          {
            "article": "Article 151",
            "explication": "La propriété privée est garantie par la loi, sous réserve des limitations imposées par l'intérêt général."
          },
          {
            "article": "Article 152",
            "explication": "Les biens immobiliers doivent être enregistrés auprès des autorités compétentes pour être légalement reconnus."
          },
          {
            "article": "Article 153",
            "explication": "Les conflits relatifs à la propriété sont tranchés par les tribunaux selon les règles de priorité et de possession."
          },
          {
            "article": "Article 154",
            "explication": "Les servitudes légales ou volontaires peuvent limiter l'usage exclusif d'un bien."
          },
          {
            "article": "Article 155",
            "explication": "Les successions ab intestat respectent les droits réservataires des héritiers directs."
          }
        ]
      },
      {
      "titre": "Titre XIII : Dispositions transitoires",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Adaptations légales",
          "articles": [
            {
              "article": "Article 156",
              "explication": "Les dispositions du Code civil s'appliquent immédiatement aux affaires nouvelles."
            },
            {
              "article": "Article 157",
              "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
            },
            {
              "article": "Article 158",
              "explication": "Les contrats conclus avant l'entrée en vigueur du Code civil restent régis par les lois antérieures."
            },
            {
              "article": "Article 159",
              "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
            },
            {
              "article": "Article 160",
              "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Entrée en vigueur",
          "articles": [
            {
              "article": "Article 161",
              "explication": "Le présent Code civil entre en vigueur à la date de sa publication au Journal officiel."
            },
            {
              "article": "Article 162",
              "explication": "Les dispositions antérieures contraires au présent Code sont abrogées."
            },
            {
              "article": "Article 163",
              "explication": "Les textes subséquents au Code civil doivent être interprétés conformément à ses principes."
            },
            {
              "article": "Article 164",
              "explication": "Les modifications du Code civil nécessitent une loi spéciale adoptée par l'Assemblée nationale."
            },
            {
              "article": "Article 165",
              "explication": "Les règlements d'application du Code civil sont pris par décret après avis des autorités compétentes."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XIV : Dispositions complémentaires",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : De la responsabilité civile",
          "articles": [
            {
              "article": "Article 166",
              "explication": "Toute personne qui cause un dommage à autrui est tenue de le réparer, sauf s'il prouve qu'il n'y a pas eu faute."
            },
            {
              "article": "Article 167",
              "explication": "La réparation du dommage peut inclure des indemnités pour préjudice matériel ou moral."
            },
            {
              "article": "Article 168",
              "explication": "Les parents sont responsables des dommages causés par leurs enfants mineurs sous leur garde."
            },
            {
              "article": "Article 169",
              "explication": "Les professionnels (médecins, avocats, ingénieurs) sont responsables des dommages causés par leur négligence ou imprudence."
            },
            {
              "article": "Article 170",
              "explication": "Les employeurs sont responsables des dommages causés par leurs employés dans l'exercice de leurs fonctions."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Des obligations alimentaires",
          "articles": [
            {
              "article": "Article 171",
              "explication": "Les époux ont l'obligation mutuelle de se soutenir financièrement pendant le mariage."
            },
            {
              "article": "Article 172",
              "explication": "En cas de divorce, l'époux économiquement désavantagé peut demander une pension alimentaire."
            },
            {
              "article": "Article 173",
              "explication": "Les parents ont l'obligation légale de subvenir aux besoins de leurs enfants jusqu'à leur majorité."
            },
            {
              "article": "Article 174",
              "explication": "Les enfants majeurs peuvent demander une contribution parentale s'ils poursuivent des études supérieures."
            },
            {
              "article": "Article 175",
              "explication": "Les petits-enfants peuvent être appelés à subvenir aux besoins de leurs grands-parents si leurs parents ne peuvent pas le faire."
            }
          ]
        },



        {
          "chapitre": "Chapitre 3 : Des droits extrapatrimoniaux",
          "articles": [
            {
              "article": "Article 176",
              "explication": "Le droit à l'image est protégé par la loi, et toute utilisation non autorisée peut donner lieu à des poursuites."
            },
            {
              "article": "Article 177",
              "explication": "Le respect de la vie privée est un droit fondamental, et toute intrusion illégale est sanctionnée."
            },
            {
              "article": "Article 178",
              "explication": "La diffamation ou l'injure publique peut entraîner des sanctions civiles ou pénales."
            },
            {
              "article": "Article 179",
              "explication": "Les atteintes aux droits extrapatrimoniaux peuvent être réparées par une indemnité compensatoire."
            },
            {
              "article": "Article 180",
              "explication": "Les médias doivent respecter les droits des personnes lors de la diffusion d'informations."
            }
          ]
        },
        {
          "chapitre": "Chapitre 4 : Des droits numériques",
          "articles": [
            {
              "article": "Article 181",
              "explication": "Les plateformes numériques doivent garantir la confidentialité des informations collectées auprès des utilisateurs."
            },
            {
              "article": "Article 182",
              "explication": "Les violations des données personnelles peuvent entraîner des sanctions pénales ou civiles."
            },
            {
              "article": "Article 183",
              "explication": "Les utilisateurs ont le droit de demander la suppression de leurs données personnelles."
            },
            {
              "article": "Article 184",
              "explication": "Les contrats numériques doivent être transparents et respecter les droits des consommateurs."
            },
            {
              "article": "Article 185",
              "explication": "Les cyberattaques ou fraudes électroniques sont sévèrement punies par la loi."
            }
          ]
        },
        {
          "chapitre": "Chapitre 5 : Des personnes âgées",
          "articles": [
            {
              "article": "Article 186",
              "explication": "Les personnes âgées ont droit à une protection spéciale contre toute forme de négligence ou d'abus."
            },
            {
              "article": "Article 187",
              "explication": "L'État doit garantir l'accès des personnes âgées aux soins de santé et aux pensions sociales."
            },
            {
              "article": "Article 188",
              "explication": "Les familles sont responsables de l'entretien et de la protection des personnes âgées dépendantes."
            },
            {
              "article": "Article 189",
              "explication": "Les institutions spécialisées pour personnes âgées doivent respecter des normes strictes de qualité et de sécurité."
            },
            {
              "article": "Article 190",
              "explication": "Les personnes âgées peuvent bénéficier d'une assistance juridique gratuite en cas de besoin."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XV : Dispositions spéciales",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Des droits des femmes",
          "articles": [
            {
              "article": "Article 191",
              "explication": "Les femmes jouissent des mêmes droits que les hommes dans tous les domaines, y compris en matière de mariage et de succession."
            },
            {
              "article": "Article 192",
              "explication": "Les violences faites aux femmes sont sanctionnées par des peines pénales et des mesures de protection."
            },
            {
              "article": "Article 193",
              "explication": "Les femmes victimes de violence conjugale peuvent bénéficier d'une ordonnance de protection."
            },
            {
              "article": "Article 194",
              "explication": "Les femmes ont le droit de participer à la gestion des biens familiaux sur un pied d'égalité."
            },
            {
              "article": "Article 195",
              "explication": "Les discriminations basées sur le genre sont interdites dans tous les domaines de la vie sociale."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Des droits des enfants",
          "articles": [
            {
              "article": "Article 196",
              "explication": "Les enfants ont droit à une éducation gratuite et obligatoire jusqu'à l'âge de 16 ans."
            },
            {
              "article": "Article 197",
              "explication": "Les enfants victimes de violences physiques ou psychologiques peuvent bénéficier d'une assistance judiciaire."
            },
            {
              "article": "Article 198",
              "explication": "Les parents ou tuteurs légaux doivent veiller à la sécurité et au bien-être des mineurs."
            },
            {
              "article": "Article 199",
              "explication": "Les enfants placés sous tutelle bénéficient d'une protection spéciale contre toute forme d'abus."
            },
            {
              "article": "Article 200",
              "explication": "Les enfants adoptés jouissent des mêmes droits que les enfants biologiques, y compris en matière de succession."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XVI : Dispositions générales",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Principes généraux",
          "articles": [
            {
              "article": "Article 201",
              "explication": "Les dispositions du Code civil s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
            },
            {
              "article": "Article 202",
              "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
            },
            {
              "article": "Article 203",
              "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
            },
            {
              "article": "Article 204",
              "explication": "Les modifications du Code civil nécessitent une loi spéciale adoptée par l'Assemblée nationale."
            },
            {
              "article": "Article 205",
              "explication": "Les règlements d'application du Code civil sont pris par décret après avis des autorités compétentes."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Entrée en vigueur",
          "articles": [
            {
              "article": "Article 206",
              "explication": "Le présent Code civil entre en vigueur à la date de sa publication au Journal officiel."
            },
            {
              "article": "Article 207",
              "explication": "Les dispositions antérieures contraires au présent Code sont abrogées."
            },
            {
              "article": "Article 208",
              "explication": "Les textes subséquents au Code civil doivent être interprétés conformément à ses principes."
            },
            {
              "article": "Article 209",
              "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
            },
            {
              "article": "Article 210",
              "explication": "Les contrats conclus avant l'entrée en vigueur du Code civil restent régis par les lois antérieures."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XVII : Dispositions diverses",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Des successions",
          "articles": [
            {
              "article": "Article 211",
              "explication": "En l'absence de testament, les biens du défunt sont répartis selon les règles de la succession légale."
            },
            {
              "article": "Article 212",
              "explication": "Les héritiers réservataires (conjoint, enfants) ont droit à une part minimale des biens du défunt."
            },
            {
              "article": "Article 213",
              "explication": "Les collatéraux (frères, sœurs, cousins) ne peuvent hériter qu'en l'absence d'héritiers directs."
            },
            {
              "article": "Article 214",
              "explication": "Les legs excessifs peuvent être réduits pour protéger les droits des héritiers réservataires."
            },
            {
              "article": "Article 215",
              "explication": "Les successions avec testament respectent les clauses fixées par le défunt, sous réserve des droits réservataires."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Des donations",
          "articles": [
            {
              "article": "Article 216",
              "explication": "Les donations entre vifs doivent être constatées par acte authentique pour être valides."
            },
            {
              "article": "Article 217",
              "explication": "Les donations peuvent être révoquées en cas d'ingratitude du donataire."
            },
            {
              "article": "Article 218",
              "explication": "Les donations excessives peuvent être réduites pour protéger les droits des héritiers réservataires."
            },
            {
              "article": "Article 219",
              "explication": "Les donations avec charge doivent être exécutées selon les conditions fixées par le donateur."
            },
            {
              "article": "Article 220",
              "explication": "Les donations peuvent inclure des biens meubles ou immeubles, mais doivent respecter les droits des tiers."
            }
          ]
        },



        {
          "chapitre": "Chapitre 3 : Des servitudes",
          "articles": [
            {
              "article": "Article 221",
              "explication": "Les servitudes légales concernent les droits d'accès, de passage, et d'eau."
            },
            {
              "article": "Article 222",
              "explication": "Les servitudes volontaires sont établies par contrat entre propriétaires."
            },
            {
              "article": "Article 223",
              "explication": "Les servitudes cessent en cas de renonciation ou de disparition de leur objet."
            },
            {
              "article": "Article 224",
              "explication": "Les servitudes peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
            },
            {
              "article": "Article 225",
              "explication": "Les servitudes imposées par la loi ne peuvent être contestées que dans des cas exceptionnels."
            }
          ]
        },
        {
          "chapitre": "Chapitre 4 : Des biens immatériels",
          "articles": [
            {
              "article": "Article 226",
              "explication": "Les biens immatériels incluent les droits d'auteur, les brevets, et les marques."
            },
            {
              "article": "Article 227",
              "explication": "Les créateurs de biens immatériels bénéficient d'une protection légale contre toute contrefaçon."
            },
            {
              "article": "Article 228",
              "explication": "Les droits sur les biens immatériels peuvent être transmis par succession ou vente."
            },
            {
              "article": "Article 229",
              "explication": "Les contrats relatifs aux biens immatériels doivent être constatés par écrit pour être opposables."
            },
            {
              "article": "Article 230",
              "explication": "Les litiges relatifs aux biens immatériels sont tranchés par les tribunaux compétents selon les règles spécifiques."
            }
          ]
        },
        {
          "chapitre": "Chapitre 5 : Des obligations alimentaires",
          "articles": [
            {
              "article": "Article 231",
              "explication": "Les époux ont l'obligation mutuelle de se soutenir financièrement pendant le mariage."
            },
            {
              "article": "Article 232",
              "explication": "En cas de divorce, l'époux économiquement désavantagé peut demander une pension alimentaire."
            },
            {
              "article": "Article 233",
              "explication": "Les parents ont l'obligation légale de subvenir aux besoins de leurs enfants jusqu'à leur majorité."
            },
            {
              "article": "Article 234",
              "explication": "Les enfants majeurs peuvent demander une contribution parentale s'ils poursuivent des études supérieures."
            },
            {
              "article": "Article 235",
              "explication": "Les petits-enfants peuvent être appelés à subvenir aux besoins de leurs grands-parents si leurs parents ne peuvent pas le faire."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XVIII : Dispositions finales complémentaires",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Adaptations locales",
          "articles": [
            {
              "article": "Article 236",
              "explication": "Les dispositions du Code civil sont adaptées aux réalités culturelles et sociales du Cameroun."
            },
            {
              "article": "Article 237",
              "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
            },
            {
              "article": "Article 238",
              "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
            },
            {
              "article": "Article 239",
              "explication": "Les autorités locales peuvent proposer des adaptations spécifiques pour répondre aux besoins des communautés."
            },
            {
              "article": "Article 240",
              "explication": "Les modifications des coutumes locales nécessitent l'accord des communautés concernées."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Entrée en vigueur",
          "articles": [
            {
              "article": "Article 241",
              "explication": "Le présent Code civil entre en vigueur à la date de sa publication au Journal officiel."
            },
            {
              "article": "Article 242",
              "explication": "Les dispositions antérieures contraires au présent Code sont abrogées."
            },
            {
              "article": "Article 243",
              "explication": "Les textes subséquents au Code civil doivent être interprétés conformément à ses principes."
            },
            {
              "article": "Article 244",
              "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
            },
            {
              "article": "Article 245",
              "explication": "Les contrats conclus avant l'entrée en vigueur du Code civil restent régis par les lois antérieures."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XIX : Dispositions nouvelles",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Protection des données personnelles",
          "articles": [
            {
              "article": "Article 246",
              "explication": "Les données personnelles collectées doivent être protégées contre toute utilisation abusive."
            },
            {
              "article": "Article 247",
              "explication": "Les utilisateurs ont le droit de demander la suppression ou la correction de leurs données personnelles."
            },
            {
              "article": "Article 248",
              "explication": "Les violations des données personnelles peuvent entraîner des sanctions pénales ou civiles."
            },
            {
              "article": "Article 249",
              "explication": "Les plateformes numériques doivent garantir la confidentialité des informations collectées auprès des utilisateurs."
            },
            {
              "article": "Article 250",
              "explication": "Les contrats numériques doivent être transparents et respecter les droits des consommateurs."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Droits des mineurs",
          "articles": [
            {
              "article": "Article 251",
              "explication": "Les mineurs bénéficient d'une protection spéciale contre toute forme d'exploitation ou de violence."
            },
            {
              "article": "Article 252",
              "explication": "Les parents ou tuteurs légaux doivent veiller à la sécurité et au bien-être des mineurs."
            },
            {
              "article": "Article 253",
              "explication": "Les mineurs victimes de violences physiques ou psychologiques peuvent bénéficier d'une assistance judiciaire."
            },
            {
              "article": "Article 254",
              "explication": "Les mineurs placés sous tutelle bénéficient d'une protection spéciale contre toute forme d'abus."
            },
            {
              "article": "Article 255",
              "explication": "Les mineurs ont le droit à une éducation gratuite et obligatoire jusqu'à l'âge de 16 ans."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XX : Articles divers",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Règles générales",
          "articles": [
            {
              "article": "Article 256",
              "explication": "Toute personne humaine jouit de la personnalité juridique dès sa naissance vivante."
            },
            {
              "article": "Article 257",
              "explication": "La capacité est définie comme la faculté de jouir et d'exercer des droits."
            },
            {
              "article": "Article 258",
              "explication": "Les mineurs et les majeurs protégés sont soumis à des incapacités spéciales."
            },
            {
              "article": "Article 259",
              "explication": "Les personnes handicapées jouissent des mêmes droits que toute autre personne."
            },
            {
              "article": "Article 260",
              "explication": "La disparition prolongée d'une personne peut être déclarée par un tribunal après une enquête approfondie."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Articles additionnels",
          "articles": [
            {
              "article": "Article 261",
              "explication": "Les personnes morales sont des entités distinctes des personnes physiques."
            },
            {
              "article": "Article 262",
              "explication": "Les associations doivent être enregistrées auprès des autorités compétentes."
            },
            {
              "article": "Article 263",
              "explication": "Les sociétés peuvent être civiles (non commerciales) ou commerciales."
            },
            {
              "article": "Article 264",
              "explication": "Les mariages doivent être célébrés devant un officier d'état civil."
            },
            {
              "article": "Article 265",
              "explication": "Le divorce est prononcé par un tribunal. Liquidation des biens communs."
            }
          ]
        },


        {
          "chapitre": "Chapitre 3 : Droits des personnes âgées",
          "articles": [
            {
              "article": "Article 266",
              "explication": "Les personnes âgées ont droit à une protection spéciale contre toute forme de négligence ou d'abus."
            },
            {
              "article": "Article 267",
              "explication": "L'État doit garantir l'accès des personnes âgées aux soins de santé et aux pensions sociales."
            },
            {
              "article": "Article 268",
              "explication": "Les familles sont responsables de l'entretien et de la protection des personnes âgées dépendantes."
            },
            {
              "article": "Article 269",
              "explication": "Les institutions spécialisées pour personnes âgées doivent respecter des normes strictes de qualité et de sécurité."
            },
            {
              "article": "Article 270",
              "explication": "Les personnes âgées peuvent bénéficier d'une assistance juridique gratuite en cas de besoin."
            }
          ]
        },
        {
          "chapitre": "Chapitre 4 : Responsabilité civile",
          "articles": [
            {
              "article": "Article 271",
              "explication": "Toute personne qui cause un dommage à autrui est tenue de le réparer, sauf s'il prouve qu'il n'y a pas eu faute."
            },
            {
              "article": "Article 272",
              "explication": "La réparation du dommage peut inclure des indemnités pour préjudice matériel ou moral."
            },
            {
              "article": "Article 273",
              "explication": "Les parents sont responsables des dommages causés par leurs enfants mineurs sous leur garde."
            },
            {
              "article": "Article 274",
              "explication": "Les professionnels (médecins, avocats, ingénieurs) sont responsables des dommages causés par leur négligence ou imprudence."
            },
            {
              "article": "Article 275",
              "explication": "Les employeurs sont responsables des dommages causés par leurs employés dans l'exercice de leurs fonctions."
            }
          ]
        },
        {
          "chapitre": "Chapitre 5 : Dispositions transitoires",
          "articles": [
            {
              "article": "Article 276",
              "explication": "Les dispositions du Code civil s'appliquent immédiatement aux affaires nouvelles."
            },
            {
              "article": "Article 277",
              "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
            },
            {
              "article": "Article 278",
              "explication": "Les contrats conclus avant l'entrée en vigueur du Code civil restent régis par les lois antérieures."
            },
            {
              "article": "Article 279",
              "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
            },
            {
              "article": "Article 280",
              "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XXI : Dispositions finales complémentaires",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Principes généraux",
          "articles": [
            {
              "article": "Article 281",
              "explication": "Les dispositions du Code civil s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
            },
            {
              "article": "Article 282",
              "explication": "Les modifications du Code civil nécessitent une loi spéciale adoptée par l'Assemblée nationale."
            },
            {
              "article": "Article 283",
              "explication": "Les règlements d'application du Code civil sont pris par décret après avis des autorités compétentes."
            },
            {
              "article": "Article 284",
              "explication": "Les textes subséquents au Code civil doivent être interprétés conformément à ses principes."
            },
            {
              "article": "Article 285",
              "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Entrée en vigueur",
          "articles": [
            {
              "article": "Article 286",
              "explication": "Le présent Code civil entre en vigueur à la date de sa publication au Journal officiel."
            },
            {
              "article": "Article 287",
              "explication": "Les dispositions antérieures contraires au présent Code sont abrogées."
            },
            {
              "article": "Article 288",
              "explication": "Les textes subséquents au Code civil doivent être interprétés conformément à ses principes."
            },
            {
              "article": "Article 289",
              "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
            },
            {
              "article": "Article 290",
              "explication": "Les contrats conclus avant l'entrée en vigueur du Code civil restent régis par les lois antérieures."
            }
          ]
        }
      ]
    },
    {
      "titre": "Titre XXII : Articles additionnels",
      "chapitres": [
        {
          "chapitre": "Chapitre 1 : Règles spécifiques",
          "articles": [
            {
              "article": "Article 291",
              "explication": "Les successions ab intestat respectent les droits réservataires des héritiers directs."
            },
            {
              "article": "Article 292",
              "explication": "Les legs excessifs peuvent être réduits pour protéger les droits des héritiers réservataires."
            },
            {
              "article": "Article 293",
              "explication": "Les donations avec charge doivent être exécutées selon les conditions fixées par le donateur."
            },
            {
              "article": "Article 294",
              "explication": "Les servitudes légales ou volontaires peuvent limiter l'usage exclusif d'un bien."
            },
            {
              "article": "Article 295",
              "explication": "Les biens immobiliers doivent être enregistrés auprès des autorités compétentes pour être légalement reconnus."
            }
          ]
        },
        {
          "chapitre": "Chapitre 2 : Clauses finales",
          "articles": [
            {
              "article": "Article 296",
              "explication": "Les dispositions du Code civil sont adaptées aux réalités culturelles et sociales du Cameroun."
            },
            {
              "article": "Article 297",
              "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
            },
            {
              "article": "Article 298",
              "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
            },
            {
              "article": "Article 299",
              "explication": "Les autorités locales peuvent proposer des adaptations spécifiques pour répondre aux besoins des communautés."
            },
            {
              "article": "Article 300",
              "explication": "Les modifications des coutumes locales nécessitent l'accord des communautés concernées."
            }
          ]
        }
      ]
      }
  
      ]
    },
  {
    "livre": "Livre II : Des biens et des différentes modifications de la propriété",
    "structure": [
      {
        "titre": "Titre I : Des biens en général",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Classification des biens",
            "articles": [
              {
                "article": "Article 301",
                "explication": "Les biens sont classés en deux catégories principales : les biens meubles et les biens immeubles."
              },
              {
                "article": "Article 302",
                "explication": "Les biens immeubles incluent les terrains, les bâtiments, et tout ce qui est attaché de manière permanente au sol."
              },
              {
                "article": "Article 303",
                "explication": "Les biens meubles comprennent les objets susceptibles de déplacement, y compris les animaux et les titres de propriété."
              },
              {
                "article": "Article 304",
                "explication": "Les biens incorporels, tels que les droits d'auteur ou les brevets, sont également considérés comme des biens meubles."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Propriété des biens",
            "articles": [
              {
                "article": "Article 305",
                "explication": "La propriété confère à son détenteur le droit d'user, de jouir, et de disposer librement des biens, sous réserve des lois et règlements."
              },
              {
                "article": "Article 306",
                "explication": "Les biens immobiliers doivent être enregistrés auprès des autorités compétentes pour garantir leur propriété légale."
              },
              {
                "article": "Article 307",
                "explication": "La propriété peut être indivise entre plusieurs personnes, dans le cadre d'une copropriété ou d'une succession."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre II : Des servitudes",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Servitudes légales",
            "articles": [
              {
                "article": "Article 308",
                "explication": "Les servitudes légales concernent les droits d'accès, de passage, et d'eau."
              },
              {
                "article": "Article 309",
                "explication": "Les servitudes légales sont imposées par la loi pour garantir un usage raisonnable des biens."
              },
              {
                "article": "Article 310",
                "explication": "Les servitudes légales ne peuvent être supprimées sans autorisation judiciaire."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Servitudes volontaires",
            "articles": [
              {
                "article": "Article 311",
                "explication": "Les servitudes volontaires sont établies par contrat entre propriétaires."
              },
              {
                "article": "Article 312",
                "explication": "Les servitudes volontaires doivent être constatées par écrit pour être opposables."
              },
              {
                "article": "Article 313",
                "explication": "Les servitudes cessent en cas de renonciation ou de disparition de leur objet."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre III : Des modifications de la propriété",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : De l'usufruit",
            "articles": [
              {
                "article": "Article 314",
                "explication": "L'usufruit confère à son titulaire le droit d'user et de jouir des biens d'autrui, sans en altérer la substance."
              },
              {
                "article": "Article 315",
                "explication": "L'usufruit peut être établi par acte notarié, testament, ou décision judiciaire."
              },
              {
                "article": "Article 316",
                "explication": "L'usufruit prend fin à l'expiration du terme fixé ou au décès de l'usufruitier."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : De l'usage et de l'habitation",
            "articles": [
              {
                "article": "Article 317",
                "explication": "Le droit d'usage permet à son titulaire d'utiliser un bien d'autrui selon ses besoins personnels."
              },
              {
                "article": "Article 318",
                "explication": "Le droit d'habitation permet à son titulaire d'occuper un logement appartenant à autrui."
              },
              {
                "article": "Article 319",
                "explication": "Les droits d'usage et d'habitation sont limités aux besoins du bénéficiaire et de sa famille."
              }
            ]
          },
          {
            "chapitre": "Chapitre 3 : Du nantissement",
            "articles": [
              {
                "article": "Article 320",
                "explication": "Le nantissement est un droit réel sur un bien mobilier ou immobilier destiné à garantir une obligation."
              },
              {
                "article": "Article 321",
                "explication": "Le créancier nanti a un droit de préférence sur le bien grevé en cas de non-paiement de la dette."
              },
              {
                "article": "Article 322",
                "explication": "Le nantissement doit être constaté par acte authentique pour être valide."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre IV : Des biens publics",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Définition et classification",
            "articles": [
              {
                "article": "Article 323",
                "explication": "Les biens publics appartiennent à l'État ou aux collectivités territoriales et sont affectés à l'usage public."
              },
              {
                "article": "Article 324",
                "explication": "Les biens publics sont inaliénables et insaisissables, sauf exception prévue par la loi."
              },
              {
                "article": "Article 325",
                "explication": "Les biens publics incluent les routes, les écoles, les hôpitaux, et les infrastructures publiques."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Gestion des biens publics",
            "articles": [
              {
                "article": "Article 326",
                "explication": "La gestion des biens publics est assurée par l'État ou les collectivités territoriales."
              },
              {
                "article": "Article 327",
                "explication": "Les biens publics peuvent être concédés à des tiers pour des usages spécifiques, sous réserve de respect des conditions légales."
              },
              {
                "article": "Article 328",
                "explication": "Toute atteinte aux biens publics est sanctionnée par des peines pénales et des amendes."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre V : Dispositions diverses",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Adaptations locales",
            "articles": [
              {
                "article": "Article 329",
                "explication": "Les dispositions du Livre II sont adaptées aux réalités culturelles et sociales du Cameroun."
              },
              {
                "article": "Article 330",
                "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
              },
              {
                "article": "Article 331",
                "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Entrée en vigueur",
            "articles": [
              {
                "article": "Article 332",
                "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
              },
              {
                "article": "Article 333",
                "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
              },
              {
                "article": "Article 334",
                "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
              }
            ]
          }
        ]
      },

      {
        "chapitre": "Chapitre 3 : Droits des tiers sur les biens",
        "articles": [
          {
            "article": "Article 335",
            "explication": "Les tiers peuvent acquérir des droits sur un bien par contrat, donation, ou succession."
          },
          {
            "article": "Article 336",
            "explication": "Les droits des tiers sur un bien doivent être constatés par écrit pour être opposables."
          },
          {
            "article": "Article 337",
            "explication": "Les tiers ne peuvent pas contester la propriété d'un bien s'ils n'ont pas de titre légal."
          },
          {
            "article": "Article 338",
            "explication": "Les conflits entre propriétaires et tiers sont tranchés par les tribunaux selon les règles de priorité."
          }
        ]
      },
      {
        "chapitre": "Chapitre 4 : Biens indivis",
        "articles": [
          {
            "article": "Article 339",
            "explication": "Les biens indivis appartiennent à plusieurs personnes qui en partagent la propriété."
          },
          {
            "article": "Article 340",
            "explication": "Les copropriétaires doivent gérer les biens indivis de manière concertée."
          },
          {
            "article": "Article 341",
            "explication": "La division des biens indivis peut être demandée par un copropriétaire après accord des autres parties."
          },
          {
            "article": "Article 342",
            "explication": "En cas de désaccord, la liquidation des biens indivis est tranchée par un tribunal."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre VI : Des biens immobiliers",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Acquisition des biens immobiliers",
        "articles": [
          {
            "article": "Article 343",
            "explication": "Les biens immobiliers peuvent être acquis par achat, donation, succession, ou prescription."
          },
          {
            "article": "Article 344",
            "explication": "L'acquisition d'un bien immobilier doit être enregistrée auprès des autorités compétentes pour être valide."
          },
          {
            "article": "Article 345",
            "explication": "Les contrats relatifs aux biens immobiliers doivent être constatés par acte authentique."
          },
          {
            "article": "Article 346",
            "explication": "Les droits des tiers sur un bien immobilier sont subordonnés à leur inscription au registre foncier."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Gestion des biens immobiliers",
        "articles": [
          {
            "article": "Article 347",
            "explication": "Les propriétaires de biens immobiliers ont l'obligation d'en assurer la maintenance et la sécurité."
          },
          {
            "article": "Article 348",
            "explication": "Les constructions sur un bien immobilier doivent respecter les normes locales d'urbanisme."
          },
          {
            "article": "Article 349",
            "explication": "Les travaux non autorisés sur un bien immobilier peuvent entraîner des sanctions administratives ou pénales."
          },
          {
            "article": "Article 350",
            "explication": "Les conflits relatifs aux biens immobiliers sont tranchés par les tribunaux fonciers ou civils."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre VII : Des biens meubles",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Classification des biens meubles",
        "articles": [
          {
            "article": "Article 351",
            "explication": "Les biens meubles corporels incluent les objets physiques susceptibles de déplacement."
          },
          {
            "article": "Article 352",
            "explication": "Les biens meubles incorporels incluent les droits d'auteur, les brevets, et les marques."
          },
          {
            "article": "Article 353",
            "explication": "Les animaux sont considérés comme des biens meubles, mais bénéficient d'une protection spéciale."
          },
          {
            "article": "Article 354",
            "explication": "Les biens meubles doivent être identifiés clairement pour éviter les litiges de propriété."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Acquisition et gestion des biens meubles",
        "articles": [
          {
            "article": "Article 355",
            "explication": "Les biens meubles peuvent être acquis par achat, donation, ou succession."
          },
          {
            "article": "Article 356",
            "explication": "Les contrats relatifs aux biens meubles doivent être constatés par écrit pour des valeurs supérieures à un certain seuil."
          },
          {
            "article": "Article 357",
            "explication": "Les biens meubles perdus ou trouvés doivent être déclarés aux autorités compétentes."
          },
          {
            "article": "Article 358",
            "explication": "Les conflits relatifs aux biens meubles sont tranchés par les tribunaux civils."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre VIII : Des servitudes spéciales",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Servitudes de passage",
        "articles": [
          {
            "article": "Article 359",
            "explication": "Une servitude de passage permet à un propriétaire d'accéder à son bien via une propriété voisine."
          },
          {
            "article": "Article 360",
            "explication": "Les servitudes de passage sont établies par contrat ou décision judiciaire."
          },
          {
            "article": "Article 361",
            "explication": "Les servitudes de passage cessent en cas de renonciation ou de disparition de leur objet."
          },
          {
            "article": "Article 362",
            "explication": "Les servitudes de passage doivent respecter les droits des propriétaires concernés."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Servitudes d'eau",
        "articles": [
          {
            "article": "Article 363",
            "explication": "Les servitudes d'eau permettent l'utilisation d'une source ou d'un cours d'eau traversant une propriété."
          },
          {
            "article": "Article 364",
            "explication": "Les servitudes d'eau sont régies par les lois sur l'environnement et les ressources naturelles."
          },
          {
            "article": "Article 365",
            "explication": "Les abus dans l'utilisation des servitudes d'eau peuvent entraîner des sanctions administratives ou pénales."
          },
          {
            "article": "Article 366",
            "explication": "Les servitudes d'eau peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre IX : Modifications de la propriété (suite)",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Du droit de superficie",
        "articles": [
          {
            "article": "Article 367",
            "explication": "Le droit de superficie confère à son titulaire le droit de construire ou d'exploiter sur un terrain appartenant à autrui."
          },
          {
            "article": "Article 368",
            "explication": "Le droit de superficie est limité dans le temps et prend fin à l'expiration du terme fixé."
          },
          {
            "article": "Article 369",
            "explication": "Le propriétaire du terrain conserve ses droits sur le sol, tandis que le superficiaire détient les droits sur les constructions."
          },
          {
            "article": "Article 370",
            "explication": "Le droit de superficie peut être transmis par succession ou vendu avec l'accord du propriétaire du terrain."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Du droit d'emphytéose",
        "articles": [
          {
            "article": "Article 371",
            "explication": "Le droit d'emphytéose permet à un tiers d'exploiter un bien immobilier pendant une longue période en échange d'un loyer."
          },
          {
            "article": "Article 372",
            "explication": "Le droit d'emphytéose est généralement utilisé pour des projets agricoles ou immobiliers."
          },
          {
            "article": "Article 373",
            "explication": "Le propriétaire conserve ses droits sur le bien, tandis que l'emphytéote a le droit d'améliorer ou de transformer le bien."
          },
          {
            "article": "Article 374",
            "explication": "Le droit d'emphytéose prend fin à l'expiration du terme fixé ou en cas de non-respect des conditions contractuelles."
          }
        ]
      },

      {
        "chapitre": "Chapitre 3 : Droits des tiers sur les biens immobiliers",
        "articles": [
          {
            "article": "Article 375",
            "explication": "Les tiers peuvent acquérir des droits sur un bien immobilier par contrat, donation, ou succession."
          },
          {
            "article": "Article 376",
            "explication": "Les droits des tiers sur un bien immobilier doivent être inscrits au registre foncier pour être opposables."
          },
          {
            "article": "Article 377",
            "explication": "Les tiers ne peuvent pas contester la propriété d'un bien immobilier s'ils n'ont pas de titre légal."
          },
          {
            "article": "Article 378",
            "explication": "Les conflits entre propriétaires et tiers sont tranchés par les tribunaux fonciers selon les règles de priorité."
          }
        ]
      },
      {
        "chapitre": "Chapitre 4 : Biens indivis immobiliers",
        "articles": [
          {
            "article": "Article 379",
            "explication": "Les biens indivis immobiliers appartiennent à plusieurs personnes qui en partagent la propriété."
          },
          {
            "article": "Article 380",
            "explication": "Les copropriétaires doivent gérer les biens indivis immobiliers de manière concertée."
          },
          {
            "article": "Article 381",
            "explication": "La division des biens indivis immobiliers peut être demandée par un copropriétaire après accord des autres parties."
          },
          {
            "article": "Article 382",
            "explication": "En cas de désaccord, la liquidation des biens indivis immobiliers est tranchée par un tribunal."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XI : Des biens meubles incorporels",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Classification des biens meubles incorporels",
        "articles": [
          {
            "article": "Article 383",
            "explication": "Les biens meubles incorporels incluent les droits d'auteur, les brevets, les marques, et les créances."
          },
          {
            "article": "Article 384",
            "explication": "Les droits sur les biens meubles incorporels sont transmissibles par contrat ou succession."
          },
          {
            "article": "Article 385",
            "explication": "Les biens meubles incorporels doivent être protégés contre toute utilisation abusive ou contrefaçon."
          },
          {
            "article": "Article 386",
            "explication": "Les contrats relatifs aux biens meubles incorporels doivent être constatés par écrit pour être opposables."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Gestion des biens meubles incorporels",
        "articles": [
          {
            "article": "Article 387",
            "explication": "Les propriétaires de biens meubles incorporels ont l'obligation d'en assurer la protection légale."
          },
          {
            "article": "Article 388",
            "explication": "Les litiges relatifs aux biens meubles incorporels sont tranchés par les tribunaux compétents."
          },
          {
            "article": "Article 389",
            "explication": "Les biens meubles incorporels peuvent être évalués pour déterminer leur valeur économique."
          },
          {
            "article": "Article 390",
            "explication": "Les biens meubles incorporels perdus ou volés peuvent faire l'objet d'une réclamation judiciaire."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XII : Des servitudes spéciales (suite)",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Servitudes de vue",
        "articles": [
          {
            "article": "Article 391",
            "explication": "Une servitude de vue permet à un propriétaire de limiter la hauteur des constructions voisines pour préserver sa vue."
          },
          {
            "article": "Article 392",
            "explication": "Les servitudes de vue sont établies par contrat ou décision judiciaire."
          },
          {
            "article": "Article 393",
            "explication": "Les servitudes de vue cessent en cas de renonciation ou de disparition de leur objet."
          },
          {
            "article": "Article 394",
            "explication": "Les servitudes de vue doivent respecter les droits des propriétaires concernés."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Servitudes de lumière",
        "articles": [
          {
            "article": "Article 395",
            "explication": "Les servitudes de lumière permettent à un propriétaire de garantir l'accès naturel à la lumière sur son bien."
          },
          {
            "article": "Article 396",
            "explication": "Les servitudes de lumière sont régies par les lois locales d'urbanisme."
          },
          {
            "article": "Article 397",
            "explication": "Les abus dans l'utilisation des servitudes de lumière peuvent entraîner des sanctions administratives ou pénales."
          },
          {
            "article": "Article 398",
            "explication": "Les servitudes de lumière peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XIII : Modifications de la propriété (suite)",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Du droit de jouissance",
        "articles": [
          {
            "article": "Article 399",
            "explication": "Le droit de jouissance confère à son titulaire le droit d'user et de jouir des biens d'autrui, sans en altérer la substance."
          },
          {
            "article": "Article 400",
            "explication": "Le droit de jouissance peut être établi par acte notarié, testament, ou décision judiciaire."
          },
          {
            "article": "Article 401",
            "explication": "Le droit de jouissance prend fin à l'expiration du terme fixé ou au décès du bénéficiaire."
          },
          {
            "article": "Article 402",
            "explication": "Le droit de jouissance peut être transmis par succession ou vendu avec l'accord du propriétaire du bien."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Du droit d'usage",
        "articles": [
          {
            "article": "Article 403",
            "explication": "Le droit d'usage permet à son titulaire d'utiliser un bien d'autrui selon ses besoins personnels."
          },
          {
            "article": "Article 404",
            "explication": "Le droit d'usage est limité aux besoins du bénéficiaire et de sa famille."
          },
          {
            "article": "Article 405",
            "explication": "Le droit d'usage prend fin à l'expiration du terme fixé ou au décès du bénéficiaire."
          },
          {
            "article": "Article 406",
            "explication": "Le droit d'usage peut être transmis par succession ou vendu avec l'accord du propriétaire du bien."
          }
        ]
      }
    ]
  },

  {
    "titre": "Titre XV : Des conflits relatifs aux biens",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Conflits entre propriétaires",
        "articles": [
          {
            "article": "Article 407",
            "explication": "Les conflits entre propriétaires sont tranchés par les tribunaux compétents selon les règles de priorité."
          },
          {
            "article": "Article 408",
            "explication": "Les litiges relatifs aux limites de propriété doivent être résolus par une expertise foncière ou géodésique."
          },
          {
            "article": "Article 409",
            "explication": "Les propriétaires peuvent demander une médiation avant de saisir les tribunaux."
          },
          {
            "article": "Article 410",
            "explication": "Les décisions judiciaires relatives aux conflits de propriété sont exécutoires après inscription au registre foncier."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Conflits avec les tiers",
        "articles": [
          {
            "article": "Article 411",
            "explication": "Les tiers ne peuvent pas contester la propriété d'un bien s'ils n'ont pas de titre légal."
          },
          {
            "article": "Article 412",
            "explication": "Les conflits entre propriétaires et tiers sont tranchés par les tribunaux selon les règles de priorité."
          },
          {
            "article": "Article 413",
            "explication": "Les tiers ayant acquis un bien de bonne foi bénéficient d'une protection légale spécifique."
          },
          {
            "article": "Article 414",
            "explication": "Les contrats frauduleux ou non conformes à la loi peuvent être annulés par un tribunal."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XVI : Des biens abandonnés ou vacants",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Biens abandonnés",
        "articles": [
          {
            "article": "Article 415",
            "explication": "Un bien est considéré comme abandonné lorsqu'il n'a plus de propriétaire identifiable."
          },
          {
            "article": "Article 416",
            "explication": "Les biens abandonnés appartiennent à l'État ou aux collectivités territoriales après une procédure administrative."
          },
          {
            "article": "Article 417",
            "explication": "Les biens abandonnés peuvent faire l'objet d'une réclamation par leurs anciens propriétaires dans un délai fixé par la loi."
          },
          {
            "article": "Article 418",
            "explication": "Les biens abandonnés sont gérés conformément aux lois sur les biens publics."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Biens vacants",
        "articles": [
          {
            "article": "Article 419",
            "explication": "Un bien vacant est un bien dont le propriétaire est inconnu ou disparu depuis une longue période."
          },
          {
            "article": "Article 420",
            "explication": "Les biens vacants sont administrés par l'État ou les collectivités territoriales jusqu'à identification du propriétaire."
          },
          {
            "article": "Article 421",
            "explication": "Les héritiers des biens vacants peuvent en revendiquer la propriété après une procédure judiciaire."
          },
          {
            "article": "Article 422",
            "explication": "Les biens vacants sont inscrits dans un registre spécial tenu par les autorités compétentes."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XVII : Des biens affectés à l'usage public",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Classification des biens publics",
        "articles": [
          {
            "article": "Article 423",
            "explication": "Les biens publics sont classés en deux catégories : les biens domaniaux et les biens affectés à un service public."
          },
          {
            "article": "Article 424",
            "explication": "Les biens domaniaux incluent les routes, les écoles, les hôpitaux, et les infrastructures publiques."
          },
          {
            "article": "Article 425",
            "explication": "Les biens affectés à un service public sont utilisés exclusivement pour les besoins de ce service."
          },
          {
            "article": "Article 426",
            "explication": "Les biens publics sont inaliénables et insaisissables, sauf exception prévue par la loi."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Gestion des biens publics",
        "articles": [
          {
            "article": "Article 427",
            "explication": "La gestion des biens publics est assurée par l'État ou les collectivités territoriales."
          },
          {
            "article": "Article 428",
            "explication": "Les biens publics peuvent être concédés à des tiers pour des usages spécifiques, sous réserve de respect des conditions légales."
          },
          {
            "article": "Article 429",
            "explication": "Toute atteinte aux biens publics est sanctionnée par des peines pénales et des amendes."
          },
          {
            "article": "Article 430",
            "explication": "Les biens publics doivent être entretenus régulièrement pour garantir leur utilisation optimale."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XVIII : Dispositions spéciales",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Protection des biens culturels",
        "articles": [
          {
            "article": "Article 431",
            "explication": "Les biens culturels, tels que les monuments historiques, sont protégés par la loi contre toute détérioration ou destruction."
          },
          {
            "article": "Article 432",
            "explication": "Les biens culturels peuvent être classés ou inscrits sur une liste spéciale pour leur préservation."
          },
          {
            "article": "Article 433",
            "explication": "Les propriétaires de biens culturels ont l'obligation d'en assurer la conservation et la restauration."
          },
          {
            "article": "Article 434",
            "explication": "Les exportations ou ventes de biens culturels nécessitent une autorisation spéciale des autorités compétentes."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Biens environnementaux",
        "articles": [
          {
            "article": "Article 435",
            "explication": "Les biens environnementaux, tels que les forêts, les cours d'eau, et les zones humides, sont protégés par la loi."
          },
          {
            "article": "Article 436",
            "explication": "L'exploitation des biens environnementaux doit respecter les normes écologiques et les lois sur l'environnement."
          },
          {
            "article": "Article 437",
            "explication": "Les atteintes aux biens environnementaux sont sanctionnées par des peines pénales et des amendes."
          },
          {
            "article": "Article 438",
            "explication": "Les projets d'aménagement ou de construction doivent intégrer des mesures de protection des biens environnementaux."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XIX : Dispositions transitoires",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Adaptations légales",
        "articles": [
          {
            "article": "Article 439",
            "explication": "Les dispositions du Livre II s'appliquent immédiatement aux affaires nouvelles."
          },
          {
            "article": "Article 440",
            "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
          },
          {
            "article": "Article 441",
            "explication": "Les contrats conclus avant l'entrée en vigueur du Livre II restent régis par les lois antérieures."
          },
          {
            "article": "Article 442",
            "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
          }
        ]
      },
      {
        "chapitre": "Chapitre 2 : Entrée en vigueur",
        "articles": [
          {
            "article": "Article 443",
            "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
          },
          {
            "article": "Article 444",
            "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
          },
          {
            "article": "Article 445",
            "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
          },
          {
            "article": "Article 446",
            "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
          }
        ]
      }
    ]
  },
  {
    "titre": "Titre XX : Articles divers",
    "chapitres": [
      {
        "chapitre": "Chapitre 1 : Règles générales",
        "articles": [
          {
            "article": "Article 447",
            "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
          },
          {
            "article": "Article 448",
            "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
          },
          {
            "article": "Article 449",
            "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
          },
          {
            "article": "Article 450",
            "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
          }
        ]
      },
      {
        "titre": "Titre XXI : Dispositions générales sur les biens",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Classification supplémentaire des biens",
            "articles": [
              {
                "article": "Article 451",
                "explication": "Les biens peuvent être classés comme consommables ou non consommables selon leur usage."
              },
              {
                "article": "Article 452",
                "explication": "Les biens consommables sont ceux qui disparaissent par leur usage normal (nourriture, carburant)."
              },
              {
                "article": "Article 453",
                "explication": "Les biens non consommables sont ceux qui résistent à l'usage normal (immeubles, machines)."
              },
              {
                "article": "Article 454",
                "explication": "Les biens fungibles sont interchangeables avec d'autres biens de même nature (argent, céréales)."
              }
            ]}
            ]
        },
          {
            "chapitre": "Chapitre 2 : Propriété collective",
            "articles": [
              {
                "article": "Article 455",
                "explication": "La propriété collective concerne les biens appartenant à une communauté ou association."
              },
              {
                "article": "Article 456",
                "explication": "Les membres de la communauté ou association doivent gérer les biens collectifs de manière concertée."
              },
              {
                "article": "Article 457",
                "explication": "La division des biens collectifs peut être demandée par un membre après accord des autres parties."
              },
              {
                "article": "Article 458",
                "explication": "En cas de désaccord, la liquidation des biens collectifs est tranchée par un tribunal."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXII : Des droits réels spéciaux",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Droit de préemption",
            "articles": [
              {
                "article": "Article 459",
                "explication": "Le droit de préemption confère à son titulaire la priorité d'achat d'un bien avant toute autre personne."
              },
              {
                "article": "Article 460",
                "explication": "Le droit de préemption est souvent utilisé dans les ventes immobilières ou foncières."
              },
              {
                "article": "Article 461",
                "explication": "Le droit de préemption doit être exercé dans un délai fixé par la loi ou le contrat."
              },
              {
                "article": "Article 462",
                "explication": "Le non-respect du droit de préemption peut entraîner des sanctions pénales ou civiles."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Droit de retrait",
            "articles": [
              {
                "article": "Article 463",
                "explication": "Le droit de retrait permet à un propriétaire de récupérer un bien vendu dans certaines conditions."
              },
              {
                "article": "Article 464",
                "explication": "Le droit de retrait doit être exercé dans un délai fixé par la loi ou le contrat."
              },
              {
                "article": "Article 465",
                "explication": "Le droit de retrait ne peut être invoqué que si le vendeur a omis de respecter certaines obligations légales."
              },
              {
                "article": "Article 466",
                "explication": "Le non-respect du droit de retrait peut entraîner des sanctions pénales ou civiles."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXIII : Des servitudes spéciales (suite)",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Servitudes de drainage",
            "articles": [
              {
                "article": "Article 467",
                "explication": "Une servitude de drainage permet à un propriétaire de drainer les eaux de son terrain via une propriété voisine."
              },
              {
                "article": "Article 468",
                "explication": "Les servitudes de drainage sont régies par les lois locales sur l'environnement et les ressources hydriques."
              },
              {
                "article": "Article 469",
                "explication": "Les abus dans l'utilisation des servitudes de drainage peuvent entraîner des sanctions administratives ou pénales."
              },
              {
                "article": "Article 470",
                "explication": "Les servitudes de drainage peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Servitudes de clôture",
            "articles": [
              {
                "article": "Article 471",
                "explication": "Une servitude de clôture permet à un propriétaire de construire ou d'entretenir une clôture sur une propriété voisine."
              },
              {
                "article": "Article 472",
                "explication": "Les servitudes de clôture sont établies par contrat ou décision judiciaire."
              },
              {
                "article": "Article 473",
                "explication": "Les servitudes de clôture cessent en cas de renonciation ou de disparition de leur objet."
              },
              {
                "article": "Article 474",
                "explication": "Les servitudes de clôture doivent respecter les droits des propriétaires concernés."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXIV : Modifications de la propriété (suite)",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Du droit de superficie (compléments)",
            "articles": [
              {
                "article": "Article 475",
                "explication": "Le droit de superficie peut inclure des clauses spécifiques sur l'usage du sol ou des constructions."
              },
              {
                "article": "Article 476",
                "explication": "Le superficiaire est responsable de l'entretien des constructions pendant la durée du droit de superficie."
              },
              {
                "article": "Article 477",
                "explication": "Le propriétaire du terrain peut récupérer les constructions à l'expiration du droit de superficie."
              },
              {
                "article": "Article 478",
                "explication": "Le droit de superficie peut être prorogé par accord mutuel entre les parties."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Du droit d'emphytéose (compléments)",
            "articles": [
              {
                "article": "Article 479",
                "explication": "Le droit d'emphytéose peut inclure des clauses spécifiques sur l'amélioration ou la transformation du bien."
              },
              {
                "article": "Article 480",
                "explication": "L'emphytéote doit payer un loyer annuel au propriétaire du bien pendant la durée du droit d'emphytéose."
              },
              {
                "article": "Article 481",
                "explication": "Le propriétaire peut récupérer le bien à l'expiration du droit d'emphytéose, y compris les améliorations apportées."
              },
              {
                "article": "Article 482",
                "explication": "Le droit d'emphytéose peut être prorogé par accord mutuel entre les parties."
              }
            ]
          }
        ]
      },

      {
        "titre": "Titre XXVI : Des conflits transfrontaliers sur les biens",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Biens situés à cheval sur deux territoires",
            "articles": [
              {
                "article": "Article 483",
                "explication": "Les biens situés à cheval sur deux territoires sont régis par les lois du pays où se trouve la majorité du bien."
              },
              {
                "article": "Article 484",
                "explication": "En cas de litige, les autorités judiciaires des deux territoires concernés doivent coopérer pour résoudre le conflit."
              },
              {
                "article": "Article 485",
                "explication": "Les parties peuvent demander une médiation internationale pour régler les différends relatifs à ces biens."
              },
              {
                "article": "Article 486",
                "explication": "Les traités internationaux prévalent sur les lois nationales en cas de conflit transfrontalier."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Biens acquis à l'étranger",
            "articles": [
              {
                "article": "Article 487",
                "explication": "Les biens acquis à l'étranger sont soumis aux lois du pays où ils ont été acquis, sauf dispositions contraires."
              },
              {
                "article": "Article 488",
                "explication": "Les ressortissants camerounais peuvent revendiquer des biens acquis à l'étranger selon les règles locales."
              },
              {
                "article": "Article 489",
                "explication": "Les biens immobiliers acquis à l'étranger doivent être déclarés aux autorités camerounaises dans un délai fixé par la loi."
              },
              {
                "article": "Article 490",
                "explication": "Les litiges relatifs aux biens acquis à l'étranger sont tranchés par les tribunaux compétents des deux pays concernés."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXVII : Des biens culturels et patrimoniaux",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Protection des biens culturels",
            "articles": [
              {
                "article": "Article 491",
                "explication": "Les biens culturels, tels que les monuments historiques, sont protégés par la loi contre toute détérioration ou destruction."
              },
              {
                "article": "Article 492",
                "explication": "Les biens culturels peuvent être classés ou inscrits sur une liste spéciale pour leur préservation."
              },
              {
                "article": "Article 493",
                "explication": "Les propriétaires de biens culturels ont l'obligation d'en assurer la conservation et la restauration."
              },
              {
                "article": "Article 494",
                "explication": "Les exportations ou ventes de biens culturels nécessitent une autorisation spéciale des autorités compétentes."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Patrimoine national",
            "articles": [
              {
                "article": "Article 495",
                "explication": "Le patrimoine national inclut les biens culturels, naturels, et historiques appartenant à l'État ou aux collectivités territoriales."
              },
              {
                "article": "Article 496",
                "explication": "La gestion du patrimoine national est assurée par des institutions spécialisées sous l'autorité de l'État."
              },
              {
                "article": "Article 497",
                "explication": "Toute atteinte au patrimoine national est sanctionnée par des peines pénales et des amendes."
              },
              {
                "article": "Article 498",
                "explication": "Les projets d'aménagement ou de construction doivent intégrer des mesures de protection du patrimoine national."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXVIII : Dispositions spéciales sur les biens environnementaux",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Protection des forêts",
            "articles": [
              {
                "article": "Article 499",
                "explication": "Les forêts sont protégées par la loi contre toute exploitation abusive ou destruction."
              },
              {
                "article": "Article 500",
                "explication": "Les activités forestières doivent respecter les normes écologiques et les lois sur l'environnement."
              },
              {
                "article": "Article 501",
                "explication": "Les atteintes aux forêts sont sanctionnées par des peines pénales et des amendes."
              },
              {
                "article": "Article 502",
                "explication": "Les projets d'aménagement forestier doivent intégrer des mesures de reforestation et de conservation."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Protection des cours d'eau",
            "articles": [
              {
                "article": "Article 503",
                "explication": "Les cours d'eau sont protégés par la loi contre toute pollution ou détérioration."
              },
              {
                "article": "Article 504",
                "explication": "Les activités industrielles ou agricoles proches des cours d'eau doivent respecter des normes strictes."
              },
              {
                "article": "Article 505",
                "explication": "Les atteintes aux cours d'eau sont sanctionnées par des peines pénales et des amendes."
              },
              {
                "article": "Article 506",
                "explication": "Les projets d'aménagement hydraulique doivent intégrer des mesures de protection des écosystèmes aquatiques."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXIX : Dispositions finales complémentaires",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Entrée en vigueur",
            "articles": [
              {
                "article": "Article 507",
                "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
              },
              {
                "article": "Article 508",
                "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
              },
              {
                "article": "Article 509",
                "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
              }
            ]
          },
          {
            "chapitre": "Chapitre 2 : Adaptations locales",
            "articles": [
              {
                "article": "Article 510",
                "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
              },
              {
                "article": "Article 511",
                "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
              }
            ]
          }
        ]
      },
      {
        "titre": "Titre XXX : Articles divers complémentaires",
        "chapitres": [
          {
            "chapitre": "Chapitre 1 : Règles générales",
            "articles": [
              {
                "article": "Article 512",
                "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
              },
              {
                "article": "Article 513",
                "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
              },
              {
                "article": "Article 514",
                "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
              },
              {
                "article": "Article 515",
                "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
              }
            ]
          },

          {
            "titre": "Titre XXXI : Dispositions sur les biens indivis",
            "chapitres": [
              {
                "chapitre": "Chapitre 1 : Gestion des biens indivis",
                "articles": [
                  {
                    "article": "Article 516",
                    "explication": "Les copropriétaires doivent gérer les biens indivis de manière concertée et dans l'intérêt commun."
                  },
                  {
                    "article": "Article 517",
                    "explication": "Toute décision concernant les biens indivis nécessite l'accord majoritaire des copropriétaires."
                  },
                  {
                    "article": "Article 518",
                    "explication": "En cas de désaccord, un tribunal peut être saisi pour trancher les litiges entre copropriétaires."
                  },
                  {
                    "article": "Article 519",
                    "explication": "Les revenus issus des biens indivis sont répartis proportionnellement aux parts de chaque copropriétaire."
                  }
                ]}
                ]
              },
              {
                "chapitre": "Chapitre 2 : Division des biens indivis",
                "articles": [
                  {
                    "article": "Article 520",
                    "explication": "La division des biens indivis peut être demandée par un copropriétaire après accord des autres parties."
                  },
                  {
                    "article": "Article 521",
                    "explication": "En cas de désaccord, la liquidation des biens indivis est tranchée par un tribunal."
                  },
                  {
                    "article": "Article 522",
                    "explication": "Le partage des biens indivis doit respecter les droits légaux de chaque copropriétaire."
                  },
                  {
                    "article": "Article 523",
                    "explication": "Les dettes communes doivent être remboursées avant la répartition des parts indivises."
                  }
                ]
              }
            ]
          },
          {
            "titre": "Titre XXXII : Dispositions sur les biens meubles incorporels",
            "chapitres": [
              {
                "chapitre": "Chapitre 1 : Droits d'auteur",
                "articles": [
                  {
                    "article": "Article 524",
                    "explication": "Les droits d'auteur protègent les œuvres littéraires, artistiques, et scientifiques contre toute contrefaçon."
                  },
                  {
                    "article": "Article 525",
                    "explication": "Les droits d'auteur confèrent à leur titulaire un droit exclusif d'exploitation de l'œuvre pendant une période déterminée."
                  },
                  {
                    "article": "Article 526",
                    "explication": "Les violations des droits d'auteur peuvent entraîner des sanctions civiles ou pénales."
                  },
                  {
                    "article": "Article 527",
                    "explication": "Les contrats relatifs aux droits d'auteur doivent être constatés par écrit pour être opposables."
                  }
                ]
              },
              {
                "chapitre": "Chapitre 2 : Brevets et marques",
                "articles": [
                  {
                    "article": "Article 528",
                    "explication": "Les brevets protègent les inventions industrielles ou techniques contre toute exploitation non autorisée."
                  },
                  {
                    "article": "Article 529",
                    "explication": "Les marques protègent les signes distinctifs (noms, logos) utilisés pour identifier des produits ou services."
                  },
                  {
                    "article": "Article 530",
                    "explication": "Les violations des brevets ou des marques peuvent entraîner des sanctions civiles ou pénales."
                  },
                  {
                    "article": "Article 531",
                    "explication": "Les contrats relatifs aux brevets ou marques doivent être constatés par écrit pour être opposables."
                  }
                ]
              }
            ]
          },
          {
            "titre": "Titre XXXIII : Dispositions sur les servitudes spéciales",
            "chapitres": [
              {
                "chapitre": "Chapitre 1 : Servitudes de pâturage",
                "articles": [
                  {
                    "article": "Article 532",
                    "explication": "Une servitude de pâturage permet à un propriétaire de faire paître son bétail sur une propriété voisine."
                  },
                  {
                    "article": "Article 533",
                    "explication": "Les servitudes de pâturage sont régies par les lois locales sur l'agriculture et l'élevage."
                  },
                  {
                    "article": "Article 534",
                    "explication": "Les abus dans l'utilisation des servitudes de pâturage peuvent entraîner des sanctions administratives ou pénales."
                  },
                  {
                    "article": "Article 535",
                    "explication": "Les servitudes de pâturage peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
                  }
                ]
              },
              {
                "chapitre": "Chapitre 2 : Servitudes de chasse",
                "articles": [
                  {
                    "article": "Article 536",
                    "explication": "Une servitude de chasse permet à un propriétaire de pratiquer la chasse sur une propriété voisine."
                  },
                  {
                    "article": "Article 537",
                    "explication": "Les servitudes de chasse sont régies par les lois locales sur la faune et la flore."
                  },
                  {
                    "article": "Article 538",
                    "explication": "Les abus dans l'utilisation des servitudes de chasse peuvent entraîner des sanctions administratives ou pénales."
                  },
                  {
                    "article": "Article 539",
                    "explication": "Les servitudes de chasse peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
                  }
                ]
              }
            ]
          },
          {
            "titre": "Titre XXXIV : Dispositions finales complémentaires",
            "chapitres": [
              {
                "chapitre": "Chapitre 1 : Entrée en vigueur",
                "articles": [
                  {
                    "article": "Article 540",
                    "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                  },
                  {
                    "article": "Article 541",
                    "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                  },
                  {
                    "article": "Article 542",
                    "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                  }
                ]
              },
              {
                "chapitre": "Chapitre 2 : Adaptations locales",
                "articles": [
                  {
                    "article": "Article 543",
                    "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                  },
                  {
                    "article": "Article 544",
                    "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                  }
                ]
              }
            ]
          },
          {
            "titre": "Titre XXXV : Articles divers complémentaires",
            "chapitres": [
              {
                "chapitre": "Chapitre 1 : Règles générales",
                "articles": [
                  {
                    "article": "Article 545",
                    "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
                  },
                  {
                    "article": "Article 546",
                    "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
                  },
                  {
                    "article": "Article 547",
                    "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
                  },
                  {
                    "article": "Article 548",
                    "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                  }
                ]
              }
            ]
          },

              {
                "titre": "Titre XXXVI : Dispositions sur les biens meubles corporels",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Classification des biens meubles corporels",
                    "articles": [
                      {
                        "article": "Article 549",
                        "explication": "Les biens meubles corporels incluent les objets matériels susceptibles de déplacement."
                      },
                      {
                        "article": "Article 550",
                        "explication": "Les animaux sont considérés comme des biens meubles corporels mais bénéficient d'une protection spéciale."
                      },
                      {
                        "article": "Article 551",
                        "explication": "Les biens meubles corporels peuvent être acquis par achat, donation, ou succession."
                      },
                      {
                        "article": "Article 552",
                        "explication": "Les contrats relatifs aux biens meubles corporels doivent être constatés par écrit pour des valeurs supérieures à un certain seuil."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Gestion des biens meubles corporels",
                    "articles": [
                      {
                        "article": "Article 553",
                        "explication": "Les propriétaires de biens meubles corporels ont l'obligation d'en assurer la maintenance et la sécurité."
                      },
                      {
                        "article": "Article 554",
                        "explication": "Les biens meubles perdus ou trouvés doivent être déclarés aux autorités compétentes."
                      },
                      {
                        "article": "Article 555",
                        "explication": "Les conflits relatifs aux biens meubles corporels sont tranchés par les tribunaux civils."
                      },
                      {
                        "article": "Article 556",
                        "explication": "Les biens meubles corporels peuvent être évalués pour déterminer leur valeur économique."
                      }
                    ]
                 
                  }
                ]
              },
              
              {
                "titre": "Titre XXXVII : Dispositions sur les biens immobiliers",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Acquisition des biens immobiliers",
                    "articles": [
                      {
                        "article": "Article 557",
                        "explication": "Les biens immobiliers peuvent être acquis par achat, donation, succession, ou prescription."
                      },
                      {
                        "article": "Article 558",
                        "explication": "L'acquisition d'un bien immobilier doit être enregistrée auprès des autorités compétentes pour être valide."
                      },
                      {
                        "article": "Article 559",
                        "explication": "Les contrats relatifs aux biens immobiliers doivent être constatés par acte authentique."
                      },
                      {
                        "article": "Article 560",
                        "explication": "Les droits des tiers sur un bien immobilier sont subordonnés à leur inscription au registre foncier."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Gestion des biens immobiliers",
                    "articles": [
                      {
                        "article": "Article 561",
                        "explication": "Les propriétaires de biens immobiliers ont l'obligation d'en assurer la maintenance et la sécurité."
                      },
                      {
                        "article": "Article 562",
                        "explication": "Les constructions sur un bien immobilier doivent respecter les normes locales d'urbanisme."
                      },
                      {
                        "article": "Article 563",
                        "explication": "Les travaux non autorisés sur un bien immobilier peuvent entraîner des sanctions administratives ou pénales."
                      },
                      {
                        "article": "Article 564",
                        "explication": "Les conflits relatifs aux biens immobiliers sont tranchés par les tribunaux fonciers ou civils."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XXXVIII : Dispositions sur les biens publics",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Classification des biens publics",
                    "articles": [
                      {
                        "article": "Article 565",
                        "explication": "Les biens publics appartiennent à l'État ou aux collectivités territoriales et sont affectés à l'usage public."
                      },
                      {
                        "article": "Article 566",
                        "explication": "Les biens publics sont inaliénables et insaisissables, sauf exception prévue par la loi."
                      },
                      {
                        "article": "Article 567",
                        "explication": "Les biens publics incluent les routes, les écoles, les hôpitaux, et les infrastructures publiques."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Gestion des biens publics",
                    "articles": [
                      {
                        "article": "Article 568",
                        "explication": "La gestion des biens publics est assurée par l'État ou les collectivités territoriales."
                      },
                      {
                        "article": "Article 569",
                        "explication": "Les biens publics peuvent être concédés à des tiers pour des usages spécifiques, sous réserve de respect des conditions légales."
                      },
                      {
                        "article": "Article 570",
                        "explication": "Toute atteinte aux biens publics est sanctionnée par des peines pénales et des amendes."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XXXIX : Dispositions finales complémentaires",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 571",
                        "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 572",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 573",
                        "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Adaptations locales",
                    "articles": [
                      {
                        "article": "Article 574",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      },
                      {
                        "article": "Article 575",
                        "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XL : Articles divers complémentaires",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Règles générales",
                    "articles": [
                      {
                        "article": "Article 576",
                        "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
                      },
                      {
                        "article": "Article 577",
                        "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
                      },
                      {
                        "article": "Article 578",
                        "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
                      },
                      {
                        "article": "Article 579",
                        "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                      }
                    ]
                  }
                ]
              },

                  {
                    "titre": "Titre XLI : Dispositions sur les biens abandonnés ou vacants",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Biens abandonnés",
                        "articles": [
                          {
                            "article": "Article 580",
                            "explication": "Un bien est considéré comme abandonné lorsqu'il n'a plus de propriétaire identifiable."
                          },
                          {
                            "article": "Article 581",
                            "explication": "Les biens abandonnés appartiennent à l'État ou aux collectivités territoriales après une procédure administrative."
                          },
                          {
                            "article": "Article 582",
                            "explication": "Les biens abandonnés peuvent faire l'objet d'une réclamation par leurs anciens propriétaires dans un délai fixé par la loi."
                          },
                          {
                            "article": "Article 583",
                            "explication": "Les biens abandonnés sont gérés conformément aux lois sur les biens publics."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Biens vacants",
                        "articles": [
                          {
                            "article": "Article 584",
                            "explication": "Un bien vacant est un bien dont le propriétaire est inconnu ou disparu depuis une longue période."
                          },
                          {
                            "article": "Article 585",
                            "explication": "Les biens vacants sont administrés par l'État ou les collectivités territoriales jusqu'à identification du propriétaire."
                          },
                          {
                            "article": "Article 586",
                            "explication": "Les héritiers des biens vacants peuvent en revendiquer la propriété après une procédure judiciaire."
                          },
                          {
                            "article": "Article 587",
                            "explication": "Les biens vacants sont inscrits dans un registre spécial tenu par les autorités compétentes."
                          }
                        ]
                        }
                    ]
                  },
                  {
                    "titre": "Titre XLII : Dispositions sur les conflits relatifs aux biens",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Conflits entre propriétaires",
                        "articles": [
                          {
                            "article": "Article 588",
                            "explication": "Les conflits entre propriétaires sont tranchés par les tribunaux compétents selon les règles de priorité."
                          },
                          {
                            "article": "Article 589",
                            "explication": "Les litiges relatifs aux limites de propriété doivent être résolus par une expertise foncière ou géodésique."
                          },
                          {
                            "article": "Article 590",
                            "explication": "Les propriétaires peuvent demander une médiation avant de saisir les tribunaux."
                          },
                          {
                            "article": "Article 591",
                            "explication": "Les décisions judiciaires relatives aux conflits de propriété sont exécutoires après inscription au registre foncier."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Conflits avec les tiers",
                        "articles": [
                          {
                            "article": "Article 592",
                            "explication": "Les tiers ne peuvent pas contester la propriété d'un bien s'ils n'ont pas de titre légal."
                          },
                          {
                            "article": "Article 593",
                            "explication": "Les conflits entre propriétaires et tiers sont tranchés par les tribunaux selon les règles de priorité."
                          },
                          {
                            "article": "Article 594",
                            "explication": "Les tiers ayant acquis un bien de bonne foi bénéficient d'une protection légale spécifique."
                          },
                          {
                            "article": "Article 595",
                            "explication": "Les contrats frauduleux ou non conformes à la loi peuvent être annulés par un tribunal."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre XLIII : Dispositions sur les biens culturels et patrimoniaux",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Protection des biens culturels",
                        "articles": [
                          {
                            "article": "Article 596",
                            "explication": "Les biens culturels, tels que les monuments historiques, sont protégés par la loi contre toute détérioration ou destruction."
                          },
                          {
                            "article": "Article 597",
                            "explication": "Les biens culturels peuvent être classés ou inscrits sur une liste spéciale pour leur préservation."
                          },
                          {
                            "article": "Article 598",
                            "explication": "Les propriétaires de biens culturels ont l'obligation d'en assurer la conservation et la restauration."
                          },
                          {
                            "article": "Article 599",
                            "explication": "Les exportations ou ventes de biens culturels nécessitent une autorisation spéciale des autorités compétentes."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Patrimoine national",
                        "articles": [
                          {
                            "article": "Article 600",
                            "explication": "Le patrimoine national inclut les biens culturels, naturels, et historiques appartenant à l'État ou aux collectivités territoriales."
                          },
                          {
                            "article": "Article 601",
                            "explication": "La gestion du patrimoine national est assurée par des institutions spécialisées sous l'autorité de l'État."
                          },
                          {
                            "article": "Article 602",
                            "explication": "Toute atteinte au patrimoine national est sanctionnée par des peines pénales et des amendes."
                          },
                          {
                            "article": "Article 603",
                            "explication": "Les projets d'aménagement ou de construction doivent intégrer des mesures de protection du patrimoine national."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre XLIV : Dispositions sur les biens environnementaux",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Protection des forêts",
                        "articles": [
                          {
                            "article": "Article 604",
                            "explication": "Les forêts sont protégées par la loi contre toute exploitation abusive ou destruction."
                          },
                          {
                            "article": "Article 605",
                            "explication": "Les activités forestières doivent respecter les normes écologiques et les lois sur l'environnement."
                          },
                          {
                            "article": "Article 606",
                            "explication": "Les atteintes aux forêts sont sanctionnées par des peines pénales et des amendes."
                          },
                          {
                            "article": "Article 607",
                            "explication": "Les projets d'aménagement forestier doivent intégrer des mesures de reforestation et de conservation."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Protection des cours d'eau",
                        "articles": [
                          {
                            "article": "Article 608",
                            "explication": "Les cours d'eau sont protégés par la loi contre toute pollution ou détérioration."
                          },
                          {
                            "article": "Article 609",
                            "explication": "Les activités industrielles ou agricoles proches des cours d'eau doivent respecter des normes strictes."
                          },
                          {
                            "article": "Article 610",
                            "explication": "Les atteintes aux cours d'eau sont sanctionnées par des peines pénales et des amendes."
                          },
                          {
                            "article": "Article 611",
                            "explication": "Les projets d'aménagement hydraulique doivent intégrer des mesures de protection des écosystèmes aquatiques."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre XLV : Dispositions finales complémentaires",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Entrée en vigueur",
                        "articles": [
                          {
                            "article": "Article 612",
                            "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                          },
                          {
                            "article": "Article 613",
                            "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                          },
                          {
                            "article": "Article 614",
                            "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Adaptations locales",
                        "articles": [
                          {
                            "article": "Article 615",
                            "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                          },
                          {
                            "article": "Article 616",
                            "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre XLVI : Articles divers complémentaires",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Règles générales",
                        "articles": [
                          {
                            "article": "Article 617",
                            "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
                          },
                          {
                            "article": "Article 618",
                            "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
                          },
                          {
                            "article": "Article 619",
                            "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
                          },
                          {
                            "article": "Article 620",
                            "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                          }
                        ]
                      },

                      {
                        "chapitre": "Chapitre 1 : Droit de préemption",
                        "articles": [
                          {
                            "article": "Article 621",
                            "explication": "Le droit de préemption confère à son titulaire la priorité d'achat d'un bien avant toute autre personne."
                          },
                          {
                            "article": "Article 622",
                            "explication": "Le droit de préemption est souvent utilisé dans les ventes immobilières ou foncières."
                          },
                          {
                            "article": "Article 623",
                            "explication": "Le droit de préemption doit être exercé dans un délai fixé par la loi ou le contrat."
                          },
                          {
                            "article": "Article 624",
                            "explication": "Le non-respect du droit de préemption peut entraîner des sanctions pénales ou civiles."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Droit de retrait",
                        "articles": [
                          {
                            "article": "Article 625",
                            "explication": "Le droit de retrait permet à un propriétaire de récupérer un bien vendu dans certaines conditions."
                          },
                          {
                            "article": "Article 626",
                            "explication": "Le droit de retrait doit être exercé dans un délai fixé par la loi ou le contrat."
                          },
                          {
                            "article": "Article 627",
                            "explication": "Le droit de retrait ne peut être invoqué que si le vendeur a omis de respecter certaines obligations légales."
                          },
                          {
                            "article": "Article 628",
                            "explication": "Le non-respect du droit de retrait peut entraîner des sanctions pénales ou civiles."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre XLVIII : Dispositions sur les servitudes spéciales",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Servitudes de drainage",
                        "articles": [
                          {
                            "article": "Article 629",
                            "explication": "Une servitude de drainage permet à un propriétaire de drainer les eaux de son terrain via une propriété voisine."
                          },
                          {
                            "article": "Article 630",
                            "explication": "Les servitudes de drainage sont régies par les lois locales sur l'environnement et les ressources hydriques."
                          },
                          {
                            "article": "Article 631",
                            "explication": "Les abus dans l'utilisation des servitudes de drainage peuvent entraîner des sanctions administratives ou pénales."
                          },
                          {
                            "article": "Article 632",
                            "explication": "Les servitudes de drainage peuvent être modifiées ou supprimées par accord mutuel des parties concernées."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Servitudes de clôture",
                        "articles": [
                          {
                            "article": "Article 633",
                            "explication": "Une servitude de clôture permet à un propriétaire de construire ou d'entretenir une clôture sur une propriété voisine."
                          },
                          {
                            "article": "Article 634",
                            "explication": "Les servitudes de clôture sont établies par contrat ou décision judiciaire."
                          },
                          {
                            "article": "Article 635",
                            "explication": "Les servitudes de clôture cessent en cas de renonciation ou de disparition de leur objet."
                          },
                          {
                            "article": "Article 636",
                            "explication": "Les servitudes de clôture doivent respecter les droits des propriétaires concernés."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre XLIX : Modifications de la propriété (suite)",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Du droit de superficie (compléments)",
                        "articles": [
                          {
                            "article": "Article 637",
                            "explication": "Le droit de superficie peut inclure des clauses spécifiques sur l'usage du sol ou des constructions."
                          },
                          {
                            "article": "Article 638",
                            "explication": "Le superficiaire est responsable de l'entretien des constructions pendant la durée du droit de superficie."
                          },
                          {
                            "article": "Article 639",
                            "explication": "Le propriétaire du terrain peut récupérer les constructions à l'expiration du droit de superficie."
                          },
                          {
                            "article": "Article 640",
                            "explication": "Le droit de superficie peut être prorogé par accord mutuel entre les parties."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Du droit d'emphytéose (compléments)",
                        "articles": [
                          {
                            "article": "Article 641",
                            "explication": "Le droit d'emphytéose peut inclure des clauses spécifiques sur l'amélioration ou la transformation du bien."
                          },
                          {
                            "article": "Article 642",
                            "explication": "L'emphytéote doit payer un loyer annuel au propriétaire du bien pendant la durée du droit d'emphytéose."
                          },
                          {
                            "article": "Article 643",
                            "explication": "Le propriétaire peut récupérer le bien à l'expiration du droit d'emphytéose, y compris les améliorations apportées."
                          },
                          {
                            "article": "Article 644",
                            "explication": "Le droit d'emphytéose peut être prorogé par accord mutuel entre les parties."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre L : Dispositions transitoires",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Adaptations légales",
                        "articles": [
                          {
                            "article": "Article 645",
                            "explication": "Les dispositions du Livre II s'appliquent immédiatement aux affaires nouvelles."
                          },
                          {
                            "article": "Article 646",
                            "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
                          },
                          {
                            "article": "Article 647",
                            "explication": "Les contrats conclus avant l'entrée en vigueur du Livre II restent régis par les lois antérieures."
                          },
                          {
                            "article": "Article 648",
                            "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                          }
                        ]
                      },
                      {
                        "chapitre": "Chapitre 2 : Entrée en vigueur",
                        "articles": [
                          {
                            "article": "Article 649",
                            "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                          },
                          {
                            "article": "Article 650",
                            "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                          },
                          {
                            "article": "Article 651",
                            "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                          },
                          {
                            "article": "Article 652",
                            "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
                          }
                        ]
                      }
                    ]
                  },
                  {
                    "titre": "Titre LI : Articles divers",
                    "chapitres": [
                      {
                        "chapitre": "Chapitre 1 : Règles générales",
                        "articles": [
                          {
                            "article": "Article 653",
                            "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
                          },
                          {
                            "article": "Article 654",
                            "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
                          },
                          {
                            "article": "Article 655",
                            "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
                          },
                          {
                            "article": "Article 656",
                            "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                          }
                        ]
                      },

                      {
                        "titre": "Titre LII : Dispositions sur les conflits transfrontaliers",
                        "chapitres": [
                          {
                            "chapitre": "Chapitre 1 : Biens situés à cheval sur deux territoires",
                            "articles": [
                              {
                                "article": "Article 657",
                                "explication": "Les biens situés à cheval sur deux territoires sont régis par les lois du pays où se trouve la majorité du bien."
                              },
                              {
                                "article": "Article 658",
                                "explication": "En cas de litige, les autorités judiciaires des deux territoires concernés doivent coopérer pour résoudre le conflit."
                              },
                              {
                                "article": "Article 659",
                                "explication": "Les parties peuvent demander une médiation internationale pour régler les différends relatifs à ces biens."
                              },
                              {
                                "article": "Article 660",
                                "explication": "Les traités internationaux prévalent sur les lois nationales en cas de conflit transfrontalier."
                              }
                            ]
                          },
                          {
                            "chapitre": "Chapitre 2 : Biens acquis à l'étranger",
                            "articles": [
                              {
                                "article": "Article 661",
                                "explication": "Les biens acquis à l'étranger sont soumis aux lois du pays où ils ont été acquis, sauf dispositions contraires."
                              },
                              {
                                "article": "Article 662",
                                "explication": "Les ressortissants camerounais peuvent revendiquer des biens acquis à l'étranger selon les règles locales."
                              },
                              {
                                "article": "Article 663",
                                "explication": "Les biens immobiliers acquis à l'étranger doivent être déclarés aux autorités camerounaises dans un délai fixé par la loi."
                              },
                              {
                                "article": "Article 664",
                                "explication": "Les litiges relatifs aux biens acquis à l'étranger sont tranchés par les tribunaux compétents des deux pays concernés."
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "titre": "Titre LIII : Dispositions sur les biens collectifs",
                        "chapitres": [
                          {
                            "chapitre": "Chapitre 1 : Propriété collective",
                            "articles": [
                              {
                                "article": "Article 665",
                                "explication": "La propriété collective concerne les biens appartenant à une communauté ou association."
                              },
                              {
                                "article": "Article 666",
                                "explication": "Les membres de la communauté ou association doivent gérer les biens collectifs de manière concertée."
                              },
                              {
                                "article": "Article 667",
                                "explication": "La division des biens collectifs peut être demandée par un membre après accord des autres parties."
                              },
                              {
                                "article": "Article 668",
                                "explication": "En cas de désaccord, la liquidation des biens collectifs est tranchée par un tribunal."
                              }
                            ]
                          },
                          {
                            "chapitre": "Chapitre 2 : Gestion des biens collectifs",
                            "articles": [
                              {
                                "article": "Article 669",
                                "explication": "Les biens collectifs doivent être gérés dans l'intérêt commun et conformément aux statuts de la communauté ou association."
                              },
                              {
                                "article": "Article 670",
                                "explication": "Les revenus issus des biens collectifs sont répartis proportionnellement aux parts de chaque membre."
                              },
                              {
                                "article": "Article 671",
                                "explication": "Les dettes communes doivent être remboursées avant la répartition des parts collectives."
                              },
                              {
                                "article": "Article 672",
                                "explication": "Les conflits relatifs aux biens collectifs sont tranchés par les tribunaux compétents."
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "titre": "Titre LIV : Dispositions finales complémentaires",
                        "chapitres": [
                          {
                            "chapitre": "Chapitre 1 : Entrée en vigueur",
                            "articles": [
                              {
                                "article": "Article 673",
                                "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                              },
                              {
                                "article": "Article 674",
                                "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                              },
                              {
                                "article": "Article 675",
                                "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                              }
                            ]
                          },
                          {
                            "chapitre": "Chapitre 2 : Adaptations locales",
                            "articles": [
                              {
                                "article": "Article 676",
                                "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                              },
                              {
                                "article": "Article 677",
                                "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                              }
                            ]
                          }
                        ]
                      },
                      {
                        "titre": "Titre LV : Articles divers complémentaires",
                        "chapitres": [
                          {
                            "chapitre": "Chapitre 1 : Règles générales",
                            "articles": [
                              {
                                "article": "Article 678",
                                "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
                              },
                              {
                                "article": "Article 679",
                                "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
                              },
                              {
                                "article": "Article 680",
                                "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
                              },
                              {
                                "article": "Article 681",
                                "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                              }
                            ]
                          },

                          {
                            "titre": "Titre LVI : Dispositions sur les biens meubles incorporels (suite)",
                            "chapitres": [
                              {
                                "chapitre": "Chapitre 1 : Droits d'auteur (compléments)",
                                "articles": [
                                  {
                                    "article": "Article 682",
                                    "explication": "Les droits d'auteur incluent les droits moraux et patrimoniaux sur une œuvre littéraire, artistique, ou scientifique."
                                  },
                                  {
                                    "article": "Article 683",
                                    "explication": "Les droits moraux sont perpétuels et inaliénables, tandis que les droits patrimoniaux sont temporaires."
                                  },
                                  {
                                    "article": "Article 684",
                                    "explication": "Les ayants droit peuvent exercer les droits d'auteur après le décès de l'auteur."
                                  },
                                  {
                                    "article": "Article 685",
                                    "explication": "Les violations des droits d'auteur peuvent entraîner des sanctions civiles, pénales, ou administratives."
                                  }
                                ]
                              },
                              {
                                "chapitre": "Chapitre 2 : Brevets et marques (compléments)",
                                "articles": [
                                  {
                                    "article": "Article 686",
                                    "explication": "Les brevets confèrent un monopole temporaire d'exploitation industrielle ou technique sur une invention."
                                  },
                                  {
                                    "article": "Article 687",
                                    "explication": "Les marques protègent les signes distinctifs utilisés pour identifier des produits ou services."
                                  },
                                  {
                                    "article": "Article 688",
                                    "explication": "Les titulaires de brevets ou de marques doivent payer des redevances annuelles pour maintenir leurs droits."
                                  },
                                  {
                                    "article": "Article 689",
                                    "explication": "Les violations des brevets ou marques peuvent entraîner des sanctions civiles, pénales, ou administratives."
                                  }
                                ]
                              }
                            ]
                          },
                          {
                            "titre": "Titre LVII : Dispositions sur les biens environnementaux (suite)",
                            "chapitres": [
                              {
                                "chapitre": "Chapitre 1 : Protection des zones humides",
                                "articles": [
                                  {
                                    "article": "Article 690",
                                    "explication": "Les zones humides sont protégées par la loi contre toute exploitation abusive ou destruction."
                                  },
                                  {
                                    "article": "Article 691",
                                    "explication": "Les activités proches des zones humides doivent respecter des normes strictes pour préserver leur écosystème."
                                  },
                                  {
                                    "article": "Article 692",
                                    "explication": "Les atteintes aux zones humides sont sanctionnées par des peines pénales et des amendes."
                                  },
                                  {
                                    "article": "Article 693",
                                    "explication": "Les projets d'aménagement doivent intégrer des mesures de protection des zones humides."
                                  }
                                ]
                              },
                              {
                                "chapitre": "Chapitre 2 : Protection des ressources minières",
                                "articles": [
                                  {
                                    "article": "Article 694",
                                    "explication": "Les ressources minières appartiennent à l'État et sont exploitées sous licence ou concession."
                                  },
                                  {
                                    "article": "Article 695",
                                    "explication": "L'exploitation minière doit respecter les lois sur l'environnement et les droits des communautés locales."
                                  },
                                  {
                                    "article": "Article 696",
                                    "explication": "Les atteintes aux ressources minières sont sanctionnées par des peines pénales et des amendes."
                                  },
                                  {
                                    "article": "Article 697",
                                    "explication": "Les projets miniers doivent inclure des plans de restauration écologique post-exploitation."
                                  }
                                ]
                              }
                            ]
                          },
                          {
                            "titre": "Titre LVIII : Dispositions finales complémentaires (suite)",
                            "chapitres": [
                              {
                                "chapitre": "Chapitre 1 : Entrée en vigueur",
                                "articles": [
                                  {
                                    "article": "Article 698",
                                    "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                                  },
                                  {
                                    "article": "Article 699",
                                    "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                                  },
                                  {
                                    "article": "Article 700",
                                    "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                                  }
                                ]
                              },
                              {
                                "chapitre": "Chapitre 2 : Adaptations locales",
                                "articles": [
                                  {
                                    "article": "Article 701",
                                    "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                                  },
                                  {
                                    "article": "Article 702",
                                    "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                                  }
                                ]
                              }
                            ]
                          },
                          {
                            "titre": "Titre LIX : Articles divers complémentaires (suite)",
                            "chapitres": [
                              {
                                "chapitre": "Chapitre 1 : Règles générales",
                                "articles": [
                                  {
                                    "article": "Article 703",
                                    "explication": "Les dispositions du Livre II s'appliquent à toutes les personnes résidant au Cameroun, sans discrimination."
                                  },
                                  {
                                    "article": "Article 704",
                                    "explication": "Les modifications du Livre II nécessitent une loi spéciale adoptée par l'Assemblée nationale."
                                  },
                                  {
                                    "article": "Article 705",
                                    "explication": "Les règlements d'application du Livre II sont pris par décret après avis des autorités compétentes."
                                  },
                                  {
                                    "article": "Article 706",
                                    "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                                  }
                                ]
                              },

                              {
                                "chapitre": "Chapitre 1 : Règles générales",
                                "articles": [
                                  {
                                    "article": "Article 707",
                                    "explication": "Les dispositions du Livre II s'appliquent sans distinction de nationalité ou de statut juridique."
                                  },
                                  {
                                    "article": "Article 708",
                                    "explication": "Les litiges relatifs au Livre II sont tranchés par les tribunaux compétents selon les règles de procédure civile."
                                  },
                                  {
                                    "article": "Article 709",
                                    "explication": "Les autorités administratives veillent à l'application stricte des dispositions du Livre II."
                                  }
                                ]
                              },
                              {
                                "chapitre": "Chapitre 2 : Clauses finales",
                                "articles": [
                                  {
                                    "article": "Article 710",
                                    "explication": "Le présent Livre II entre en vigueur à la date de sa publication au Journal officiel."
                                  },
                                  {
                                    "article": "Article 711",
                                    "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                                  },
                                  {
                                    "article": "Article 712",
                                    "explication": "Les textes subséquents au Livre II doivent être interprétés conformément à ses principes."
                                  },
                                  {
                                    "article": "Article 713",
                                    "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                                  },
                                  {
                                    "article": "Article 714",
                                    "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                                  }
                                ]
                              }
                            ]
                          }
                        ]},
          {
            "livre": "Livre III : Des successions",
            "structure": [
              {
                "titre": "Titre I : Dispositions générales sur les obligations",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Notion et sources des obligations",
                    "articles": [
                      {
                        "article": "Article 715",
                        "explication": "Les obligations sont des liens juridiques par lesquels une personne est tenue d'exécuter une prestation envers une autre."
                      },
                      {
                        "article": "Article 716",
                        "explication": "Les obligations peuvent naître de la loi, du contrat, des actes unilatéraux, ou des faits illicites."
                      },
                      {
                        "article": "Article 717",
                        "explication": "Les obligations légales sont celles imposées par la loi sans nécessité d'un accord entre les parties."
                      },
                      {
                        "article": "Article 718",
                        "explication": "Les obligations contractuelles découlent d'un accord mutuel entre les parties."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Classification des obligations",
                    "articles": [
                      {
                        "article": "Article 719",
                        "explication": "Les obligations peuvent être classées en obligations de résultat ou obligations de moyens."
                      },
                      {
                        "article": "Article 720",
                        "explication": "Une obligation de résultat implique l'obligation d'atteindre un objectif précis."
                      },
                      {
                        "article": "Article 721",
                        "explication": "Une obligation de moyens implique l'obligation de mettre en œuvre tous les efforts nécessaires pour atteindre un objectif."
                      },
                      {
                        "article": "Article 722",
                        "explication": "Les obligations peuvent également être classées comme personnelles ou réelles selon leur nature."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre II : Les contrats",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Formation des contrats",
                    "articles": [
                      {
                        "article": "Article 723",
                        "explication": "Un contrat est formé par le consentement mutuel des parties sur un objet et une cause licites."
                      },
                      {
                        "article": "Article 724",
                        "explication": "Le consentement doit être libre, éclairé, et exempt de vices tels que l'erreur, le dol, ou la violence."
                      },
                      {
                        "article": "Article 725",
                        "explication": "L'objet du contrat doit être licite, possible, et déterminé ou déterminable."
                      },
                      {
                        "article": "Article 726",
                        "explication": "La cause du contrat doit être licite et conforme à l'ordre public et aux bonnes mœurs."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Validité des contrats",
                    "articles": [
                      {
                        "article": "Article 727",
                        "explication": "Un contrat valide produit ses effets entre les parties dès sa formation."
                      },
                      {
                        "article": "Article 728",
                        "explication": "Les contrats doivent respecter les règles de forme prévues par la loi pour être opposables."
                      },
                      {
                        "article": "Article 729",
                        "explication": "Les contrats conclus sous condition suspensive ne produisent leurs effets qu'à la réalisation de la condition."
                      },
                      {
                        "article": "Article 730",
                        "explication": "Les contrats conclus sous condition résolutoire cessent de produire effet si la condition se réalise."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre III : Exécution des obligations",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Règles générales d'exécution",
                    "articles": [
                      {
                        "article": "Article 731",
                        "explication": "Les obligations doivent être exécutées conformément à leur contenu et dans les délais convenus."
                      },
                      {
                        "article": "Article 732",
                        "explication": "En cas de silence ou d'ambiguïté, les obligations sont interprétées selon les usages et la bonne foi."
                      },
                      {
                        "article": "Article 733",
                        "explication": "L'exécution des obligations peut être forcée par voie judiciaire en cas de non-respect."
                      },
                      {
                        "article": "Article 734",
                        "explication": "Les obligations doivent être exécutées au lieu convenu ou, à défaut, au lieu prévu par la loi."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Inexécution des obligations",
                    "articles": [
                      {
                        "article": "Article 735",
                        "explication": "L'inexécution d'une obligation peut entraîner des sanctions civiles, pénales, ou administratives."
                      },
                      {
                        "article": "Article 736",
                        "explication": "Le créancier peut demander réparation des dommages causés par l'inexécution."
                      },
                      {
                        "article": "Article 737",
                        "explication": "Le débiteur peut être libéré de son obligation en cas de force majeure ou d'imprévision."
                      },
                      {
                        "article": "Article 738",
                        "explication": "La force majeure est un événement imprévisible, irrésistible, et extérieur qui empêche l'exécution de l'obligation."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre IV : Extinction des obligations",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Modes d'extinction des obligations",
                    "articles": [
                      {
                        "article": "Article 739",
                        "explication": "Les obligations s'éteignent par leur accomplissement, la novation, la compensation, ou la prescription."
                      },
                      {
                        "article": "Article 740",
                        "explication": "L'accomplissement est le mode normal d'extinction des obligations."
                      },
                      {
                        "article": "Article 741",
                        "explication": "La novation remplace une obligation existante par une nouvelle obligation."
                      },
                      {
                        "article": "Article 742",
                        "explication": "La compensation permet d'éteindre des obligations réciproques entre deux parties."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Prescription des obligations",
                    "articles": [
                      {
                        "article": "Article 743",
                        "explication": "La prescription est un mode d'extinction des obligations par l'écoulement d'un délai légal."
                      },
                      {
                        "article": "Article 744",
                        "explication": "La prescription est suspendue en cas de force majeure ou d'empêchement légal."
                      },
                      {
                        "article": "Article 745",
                        "explication": "Le délai de prescription varie selon la nature de l'obligation et les dispositions légales applicables."
                      },
                      {
                        "article": "Article 746",
                        "explication": "La prescription peut être interrompue par des actes tels qu'une mise en demeure ou une assignation en justice."
                      }
                    ]
                  }
                ]
              },

              {
                "titre": "Titre V : Les quasi-contrats",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Notion et caractéristiques des quasi-contrats",
                    "articles": [
                      {
                        "article": "Article 747",
                        "explication": "Les quasi-contrats sont des situations juridiques créées par la loi sans l'intervention d'un contrat formel."
                      },
                      {
                        "article": "Article 748",
                        "explication": "Les quasi-contrats incluent la gestion d'affaires, l'enrichissement sans cause, et autres situations similaires."
                      },
                      {
                        "article": "Article 749",
                        "explication": "Les quasi-contrats reposent sur les principes d'équité et de bonne foi."
                      },
                      {
                        "article": "Article 750",
                        "explication": "Les quasi-contrats produisent des effets obligatoires entre les parties concernées."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : La gestion d'affaires",
                    "articles": [
                      {
                        "article": "Article 751",
                        "explication": "La gestion d'affaires est l'administration volontaire des affaires d'autrui sans mandat explicite."
                      },
                      {
                        "article": "Article 752",
                        "explication": "Le gestionnaire doit agir dans l'intérêt du propriétaire des affaires et rendre compte de ses actes."
                      },
                      {
                        "article": "Article 753",
                        "explication": "Le propriétaire des affaires peut demander réparation des dommages causés par une gestion négligente."
                      },
                      {
                        "article": "Article 754",
                        "explication": "En cas de gestion bénéfique, le propriétaire des affaires doit indemniser le gestionnaire pour ses frais et efforts."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 3 : L'enrichissement sans cause",
                    "articles": [
                      {
                        "article": "Article 755",
                        "explication": "L'enrichissement sans cause est l'enrichissement d'une personne au détriment d'une autre sans justification légale."
                      },
                      {
                        "article": "Article 756",
                        "explication": "Le créancier peut demander restitution de ce qui a été indûment versé ou transféré."
                      },
                      {
                        "article": "Article 757",
                        "explication": "L'enrichissement sans cause ne donne pas lieu à restitution si elle résulte d'une obligation légale ou contractuelle."
                      },
                      {
                        "article": "Article 758",
                        "explication": "La restitution doit être proportionnelle à l'enrichissement injustifié."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre VI : Les faits illicites",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Responsabilité civile délictuelle",
                    "articles": [
                      {
                        "article": "Article 759",
                        "explication": "Toute personne qui cause un dommage à autrui par un fait illicite est tenue de le réparer."
                      },
                      {
                        "article": "Article 760",
                        "explication": "Un fait illicite peut résulter d'une action intentionnelle, d'une négligence, ou d'une imprudence."
                      },
                      {
                        "article": "Article 761",
                        "explication": "La responsabilité civile suppose l'existence d'un préjudice, d'un lien de causalité, et d'une faute."
                      },
                      {
                        "article": "Article 762",
                        "explication": "Le préjudice peut être matériel, moral, ou économique, et doit être évalué pour déterminer le montant de la réparation."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Réparation du dommage",
                    "articles": [
                      {
                        "article": "Article 763",
                        "explication": "La réparation du dommage vise à rétablir la victime dans la situation où elle se serait trouvée sans le fait illicite."
                      },
                      {
                        "article": "Article 764",
                        "explication": "La réparation peut consister en une indemnité pécuniaire ou en une prestation en nature."
                      },
                      {
                        "article": "Article 765",
                        "explication": "Le juge fixe le montant de l'indemnité en tenant compte de la gravité du préjudice et des circonstances."
                      },
                      {
                        "article": "Article 766",
                        "explication": "En cas de pluralité de responsables, la solidarité peut être engagée pour la réparation du dommage."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre VII : Les obligations spéciales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Obligations alimentaires",
                    "articles": [
                      {
                        "article": "Article 767",
                        "explication": "Les obligations alimentaires sont des obligations de soutien financier dues aux membres de la famille dans le besoin."
                      },
                      {
                        "article": "Article 768",
                        "explication": "Les obligations alimentaires incluent la nourriture, le logement, les soins médicaux, et l'éducation."
                      },
                      {
                        "article": "Article 769",
                        "explication": "Les obligations alimentaires sont modulables selon les ressources du débiteur et les besoins du créancier."
                      },
                      {
                        "article": "Article 770",
                        "explication": "Les obligations alimentaires cessent en cas de décès du créancier ou de disparition du besoin."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Obligations professionnelles",
                    "articles": [
                      {
                        "article": "Article 771",
                        "explication": "Les obligations professionnelles découlent des activités exercées par une personne dans le cadre de sa profession."
                      },
                      {
                        "article": "Article 772",
                        "explication": "Les obligations professionnelles doivent respecter les règles éthiques et déontologiques applicables."
                      },
                      {
                        "article": "Article 773",
                        "explication": "Les violations des obligations professionnelles peuvent entraîner des sanctions disciplinaires ou pénales."
                      },
                      {
                        "article": "Article 774",
                        "explication": "Les obligations professionnelles peuvent inclure des clauses de confidentialité ou de non-concurrence."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre VIII : Dispositions finales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 775",
                        "explication": "Le présent Livre III entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 776",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 777",
                        "explication": "Les textes subséquents au Livre III doivent être interprétés conformément à ses principes."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Adaptations locales",
                    "articles": [
                      {
                        "article": "Article 778",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      },
                      {
                        "article": "Article 779",
                        "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                      }
                    ]
                  }
                ]
              },

              {
                "titre": "Titre IX : Les obligations solidaires",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Solidarité active",
                    "articles": [
                      {
                        "article": "Article 780",
                        "explication": "La solidarité active existe lorsque plusieurs créanciers peuvent réclamer la même obligation au débiteur."
                      },
                      {
                        "article": "Article 781",
                        "explication": "Le paiement au profit d'un créancier libère le débiteur envers tous les autres créanciers solidaires."
                      },
                      {
                        "article": "Article 782",
                        "explication": "Les créanciers solidaires doivent se partager le montant reçu proportionnellement à leurs droits respectifs."
                      },
                      {
                        "article": "Article 783",
                        "explication": "En cas de contestation, le débiteur peut exiger une preuve de l'accord entre les créanciers solidaires."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Solidarité passive",
                    "articles": [
                      {
                        "article": "Article 784",
                        "explication": "La solidarité passive existe lorsque plusieurs débiteurs sont tenus conjointement d'une même obligation."
                      },
                      {
                        "article": "Article 785",
                        "explication": "Le créancier peut réclamer l'intégralité de la dette à l'un des débiteurs solidaires."
                      },
                      {
                        "article": "Article 786",
                        "explication": "Le débiteur qui a payé la dette peut se retourner contre les autres débiteurs solidaires pour obtenir leur quote-part."
                      },
                      {
                        "article": "Article 787",
                        "explication": "Les débiteurs solidaires doivent contribuer proportionnellement à leurs engagements respectifs."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre X : Les obligations indivisibles",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature des obligations indivisibles",
                    "articles": [
                      {
                        "article": "Article 788",
                        "explication": "Une obligation est indivisible lorsque son objet ne peut pas être divisé matériellement ou juridiquement."
                      },
                      {
                        "article": "Article 789",
                        "explication": "Les obligations indivisibles impliquent que chaque partie doit exécuter ou recevoir la totalité de la prestation."
                      },
                      {
                        "article": "Article 790",
                        "explication": "L'indivisibilité peut résulter de la nature de l'objet ou d'une stipulation expresse des parties."
                      },
                      {
                        "article": "Article 791",
                        "explication": "En cas d'inexécution partielle, l'obligation reste due dans son intégralité."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Effets des obligations indivisibles",
                    "articles": [
                      {
                        "article": "Article 792",
                        "explication": "Les créanciers indivisibles doivent agir conjointement pour réclamer l'exécution de l'obligation."
                      },
                      {
                        "article": "Article 793",
                        "explication": "Les débiteurs indivisibles sont tenus solidairement de l'exécution de l'obligation."
                      },
                      {
                        "article": "Article 794",
                        "explication": "La libération d'un débiteur indivisible libère tous les autres débiteurs."
                      },
                      {
                        "article": "Article 795",
                        "explication": "Les obligations indivisibles cessent en cas de division ou de destruction de l'objet."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XI : Les obligations conditionnelles",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Obligations sous condition suspensive",
                    "articles": [
                      {
                        "article": "Article 796",
                        "explication": "Une obligation sous condition suspensive ne produit ses effets qu'à la réalisation de la condition."
                      },
                      {
                        "article": "Article 797",
                        "explication": "La condition suspensive doit être possible, licite, et non contraire à l'ordre public."
                      },
                      {
                        "article": "Article 798",
                        "explication": "En attendant la réalisation de la condition, les parties doivent s'abstenir de tout acte contraire à l'obligation."
                      },
                      {
                        "article": "Article 799",
                        "explication": "La réalisation de la condition suspensive est constatée par les parties ou par un tiers désigné."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Obligations sous condition résolutoire",
                    "articles": [
                      {
                        "article": "Article 800",
                        "explication": "Une obligation sous condition résolutoire cesse de produire effet si la condition se réalise."
                      },
                      {
                        "article": "Article 801",
                        "explication": "La condition résolutoire doit être possible, licite, et non contraire à l'ordre public."
                      },
                      {
                        "article": "Article 802",
                        "explication": "En attendant la réalisation de la condition, l'obligation reste pleinement exécutable."
                      },
                      {
                        "article": "Article 803",
                        "explication": "La réalisation de la condition résolutoire entraîne la restitution des prestations déjà effectuées."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XII : Les obligations à terme",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature des obligations à terme",
                    "articles": [
                      {
                        "article": "Article 804",
                        "explication": "Une obligation à terme est une obligation dont l'exécution est différée jusqu'à une date fixée."
                      },
                      {
                        "article": "Article 805",
                        "explication": "Le terme peut être certain ou incertain, mais il doit être raisonnable et prévisible."
                      },
                      {
                        "article": "Article 806",
                        "explication": "En cas de retard dans l'exécution, le créancier peut demander des dommages-intérêts."
                      },
                      {
                        "article": "Article 807",
                        "explication": "Le débiteur peut exécuter l'obligation avant le terme si cela n'est pas prohibé par le contrat."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Effets des obligations à terme",
                    "articles": [
                      {
                        "article": "Article 808",
                        "explication": "Les obligations à terme produisent leurs effets dès leur formation, mais leur exécution est différée."
                      },
                      {
                        "article": "Article 809",
                        "explication": "Le créancier ne peut pas exiger l'exécution avant l'expiration du terme, sauf accord des parties."
                      },
                      {
                        "article": "Article 810",
                        "explication": "Le débiteur peut anticiper l'exécution si cela ne porte pas préjudice au créancier."
                      },
                      {
                        "article": "Article 811",
                        "explication": "En cas de force majeure, le terme peut être suspendu ou reporté."
                      }
                    ]
                  }
                ]
              },

              {
                "titre": "Titre XIII : Les obligations alternatives",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature des obligations alternatives",
                    "articles": [
                      {
                        "article": "Article 812",
                        "explication": "Une obligation alternative est une obligation où le débiteur a le choix entre plusieurs prestations."
                      },
                      {
                        "article": "Article 813",
                        "explication": "Le choix doit être effectué par le débiteur, sauf stipulation contraire dans le contrat."
                      },
                      {
                        "article": "Article 814",
                        "explication": "Si l'une des prestations devient impossible, l'obligation se transforme en obligation simple sur la prestation restante."
                      },
                      {
                        "article": "Article 815",
                        "explication": "Le créancier ne peut pas forcer le débiteur à choisir une prestation spécifique, sauf en cas de mauvaise foi."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Effets des obligations alternatives",
                    "articles": [
                      {
                        "article": "Article 816",
                        "explication": "Le choix du débiteur doit être notifié au créancier pour que l'obligation devienne exécutable."
                      },
                      {
                        "article": "Article 817",
                        "explication": "En cas de retard dans le choix, le créancier peut demander la désignation judiciaire d'une prestation."
                      },
                      {
                        "article": "Article 818",
                        "explication": "Si toutes les prestations deviennent impossibles, l'obligation s'éteint par la force majeure."
                      },
                      {
                        "article": "Article 819",
                        "explication": "Les obligations alternatives sont régies par les principes généraux des obligations, sauf dispositions spécifiques."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XIV : Les obligations successives",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature des obligations successives",
                    "articles": [
                      {
                        "article": "Article 820",
                        "explication": "Une obligation successive est une obligation qui se renouvelle périodiquement selon un intervalle fixé."
                      },
                      {
                        "article": "Article 821",
                        "explication": "Les obligations successives incluent les loyers, les salaires, et les pensions alimentaires."
                      },
                      {
                        "article": "Article 822",
                        "explication": "Chaque échéance constitue une obligation distincte, mais elles sont liées par leur origine commune."
                      },
                      {
                        "article": "Article 823",
                        "explication": "Le non-paiement d'une échéance peut entraîner la résiliation de l'obligation successive."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Effets des obligations successives",
                    "articles": [
                      {
                        "article": "Article 824",
                        "explication": "Le créancier peut réclamer le paiement des échéances impayées, même après la fin de l'obligation."
                      },
                      {
                        "article": "Article 825",
                        "explication": "Le débiteur peut demander une révision des modalités de l'obligation en cas de changement de circonstances."
                      },
                      {
                        "article": "Article 826",
                        "explication": "La prescription des échéances successives court à partir de chaque échéance individuelle."
                      },
                      {
                        "article": "Article 827",
                        "explication": "Les obligations successives cessent en cas de résiliation, de novation, ou de décès des parties."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XV : Les obligations complexes",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Obligations cumulatives",
                    "articles": [
                      {
                        "article": "Article 828",
                        "explication": "Une obligation cumulative est une obligation où plusieurs prestations doivent être exécutées simultanément."
                      },
                      {
                        "article": "Article 829",
                        "explication": "Le créancier peut exiger l'exécution intégrale des prestations cumulatives."
                      },
                      {
                        "article": "Article 830",
                        "explication": "En cas d'inexécution partielle, le créancier peut demander réparation pour le préjudice subi."
                      },
                      {
                        "article": "Article 831",
                        "explication": "Les obligations cumulatives sont soumises aux règles générales des obligations."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Obligations conjointes",
                    "articles": [
                      {
                        "article": "Article 832",
                        "explication": "Une obligation conjointe est une obligation où plusieurs prestations doivent être exécutées ensemble."
                      },
                      {
                        "article": "Article 833",
                        "explication": "Le créancier ne peut pas exiger une prestation isolée sans l'accord des parties."
                      },
                      {
                        "article": "Article 834",
                        "explication": "En cas d'inexécution partielle, l'obligation reste due dans son intégralité."
                      },
                      {
                        "article": "Article 835",
                        "explication": "Les obligations conjointes cessent si l'une des prestations devient impossible."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre XVI : Dispositions transitoires et finales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Adaptations légales",
                    "articles": [
                      {
                        "article": "Article 836",
                        "explication": "Les dispositions du Livre III s'appliquent immédiatement aux affaires nouvelles."
                      },
                      {
                        "article": "Article 837",
                        "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
                      },
                      {
                        "article": "Article 838",
                        "explication": "Les contrats conclus avant l'entrée en vigueur du Livre III restent régis par les lois antérieures."
                      },
                      {
                        "article": "Article 839",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 840",
                        "explication": "Le présent Livre III entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 841",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 842",
                        "explication": "Les textes subséquents au Livre III doivent être interprétés conformément à ses principes."
                      },
                      {
                        "article": "Article 843",
                        "explication": "Les affaires en cours sont jugées conformément aux lois en vigueur au moment de leur introduction."
                      }
                    ]
                  }
                ]
              }
          
            ]
          },
          {
            "livre": "Livre IV : Des sûretés",
            "structure": [
              {
                "titre": "Titre I : Dispositions générales sur les sûretés",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature et classification des sûretés",
                    "articles": [
                      {
                        "article": "Article 844",
                        "explication": "Les sûretés sont des mécanismes juridiques destinés à garantir l'exécution d'une obligation."
                      },
                      {
                        "article": "Article 845",
                        "explication": "Les sûretés peuvent être classées en sûretés réelles et sûretés personnelles."
                      },
                      {
                        "article": "Article 846",
                        "explication": "Les sûretés réelles confèrent un droit direct sur un bien, tandis que les sûretés personnelles reposent sur l'engagement d'une tierce personne."
                      },
                      {
                        "article": "Article 847",
                        "explication": "Les sûretés doivent respecter les règles de publicité pour être opposables aux tiers."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Publicité des sûretés",
                    "articles": [
                      {
                        "article": "Article 848",
                        "explication": "La publicité des sûretés est assurée par leur inscription dans un registre officiel ou par un acte authentique."
                      },
                      {
                        "article": "Article 849",
                        "explication": "L'inscription des sûretés permet de protéger les droits des créanciers et des tiers de bonne foi."
                      },
                      {
                        "article": "Article 850",
                        "explication": "Les sûretés non publiées ne sont pas opposables aux tiers."
                      },
                      {
                        "article": "Article 851",
                        "explication": "Les frais de publicité des sûretés sont à la charge du débiteur ou du créancier selon les modalités convenues."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre II : Les sûretés réelles",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : L'hypothèque",
                    "articles": [
                      {
                        "article": "Article 852",
                        "explication": "L'hypothèque est une sûreté réelle constituée sur un bien immobilier pour garantir une obligation."
                      },
                      {
                        "article": "Article 853",
                        "explication": "L'hypothèque doit être constatée par acte authentique et inscrite au registre foncier."
                      },
                      {
                        "article": "Article 854",
                        "explication": "Le créancier hypothécaire a un droit de préférence sur le bien grevé en cas de non-paiement."
                      },
                      {
                        "article": "Article 855",
                        "explication": "L'hypothèque peut être levée par remboursement intégral de la dette ou par accord des parties."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Le privilège",
                    "articles": [
                      {
                        "article": "Article 856",
                        "explication": "Le privilège est une sûreté réelle légale donnant un droit de préférence sur certains biens du débiteur."
                      },
                      {
                        "article": "Article 857",
                        "explication": "Les privilèges peuvent être généraux (portant sur tous les biens du débiteur) ou spéciaux (portant sur un bien précis)."
                      },
                      {
                        "article": "Article 858",
                        "explication": "Les privilèges spéciaux ont priorité sur les privilèges généraux et les hypothèques."
                      },
                      {
                        "article": "Article 859",
                        "explication": "Les privilèges sont régis par la loi et ne nécessitent pas d'inscription pour être opposables."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 3 : Le nantissement",
                    "articles": [
                      {
                        "article": "Article 860",
                        "explication": "Le nantissement est une sûreté réelle constituée sur un bien meuble pour garantir une obligation."
                      },
                      {
                        "article": "Article 861",
                        "explication": "Le nantissement peut porter sur des biens corporels (matériels) ou incorporels (droits)."
                      },
                      {
                        "article": "Article 862",
                        "explication": "Le créancier nanti a un droit de suite et de préférence sur le bien grevé en cas de non-paiement."
                      },
                      {
                        "article": "Article 863",
                        "explication": "Le nantissement doit être constaté par écrit pour être valable."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre III : Les sûretés personnelles",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : La caution",
                    "articles": [
                      {
                        "article": "Article 864",
                        "explication": "La caution est une sûreté personnelle où une tierce personne s'engage à payer la dette du débiteur en cas de défaillance."
                      },
                      {
                        "article": "Article 865",
                        "explication": "L'engagement de la caution doit être constaté par écrit pour être valable."
                      },
                      {
                        "article": "Article 866",
                        "explication": "La caution bénéficie des mêmes droits et recours que le créancier contre le débiteur principal."
                      },
                      {
                        "article": "Article 867",
                        "explication": "La caution peut exiger une libération proportionnelle si elle est solidaire avec d'autres cautions."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : La garantie autonome",
                    "articles": [
                      {
                        "article": "Article 868",
                        "explication": "La garantie autonome est une obligation indépendante de la validité de l'obligation principale."
                      },
                      {
                        "article": "Article 869",
                        "explication": "La garantie autonome est souvent utilisée dans les contrats commerciaux et financiers."
                      },
                      {
                        "article": "Article 870",
                        "explication": "Le garant autonome s'engage à payer sur simple demande conforme aux termes du contrat."
                      },
                      {
                        "article": "Article 871",
                        "explication": "La garantie autonome ne peut être contestée que pour fraude manifeste ou abus de droit."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre IV : Extinction des sûretés",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Modes d'extinction",
                    "articles": [
                      {
                        "article": "Article 872",
                        "explication": "Les sûretés s'éteignent par paiement de la dette, novation, prescription, ou renonciation."
                      },
                      {
                        "article": "Article 873",
                        "explication": "La réalisation de la sûreté (vente du bien grevé) entraîne son extinction."
                      },
                      {
                        "article": "Article 874",
                        "explication": "La prescription des sûretés varie selon leur nature et les dispositions légales applicables."
                      },
                      {
                        "article": "Article 875",
                        "explication": "La renonciation aux sûretés doit être constatée par écrit pour être valable."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Effets de l'extinction",
                    "articles": [
                      {
                        "article": "Article 876",
                        "explication": "L'extinction des sûretés libère le bien grevé ou la caution de toute obligation."
                      },
                      {
                        "article": "Article 877",
                        "explication": "Le créancier doit restituer les titres ou documents relatifs à la sûreté après son extinction."
                      },
                      {
                        "article": "Article 878",
                        "explication": "En cas de vente forcée, le produit de la vente est affecté au remboursement de la dette garantie."
                      },
                      {
                        "article": "Article 879",
                        "explication": "Les sûretés éteintes ne peuvent être réactivées sans un nouvel acte de constitution."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre V : Dispositions finales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 880",
                        "explication": "Le présent Livre IV entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 881",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 882",
                        "explication": "Les textes subséquents au Livre IV doivent être interprétés conformément à ses principes."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Adaptations locales",
                    "articles": [
                      {
                        "article": "Article 883",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      },
                      {
                        "article": "Article 884",
                        "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                      }
                    ]
                  }
                ]
              }
            ]
          },

          {
            "livre": "Livre V : Du droit des personnes",
            "structure": [
              {
                "titre": "Titre I : Dispositions générales sur les personnes",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature juridique des personnes",
                    "articles": [
                      {
                        "article": "Article 885",
                        "explication": "Les personnes sont des entités juridiques titulaires de droits et d'obligations."
                      },
                      {
                        "article": "Article 886",
                        "explication": "Les personnes peuvent être physiques (êtres humains) ou morales (entités créées par la loi)."
                      },
                      {
                        "article": "Article 887",
                        "explication": "Les personnes physiques ont une capacité juridique dès leur naissance."
                      },
                      {
                        "article": "Article 888",
                        "explication": "Les personnes morales acquièrent leur personnalité juridique à leur constitution légale."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Capacité juridique",
                    "articles": [
                      {
                        "article": "Article 889",
                        "explication": "La capacité juridique est l'aptitude à exercer des droits et à contracter des obligations."
                      },
                      {
                        "article": "Article 890",
                        "explication": "La capacité peut être pleine (majeurs sains d'esprit) ou restreinte (mineurs, incapables)."
                      },
                      {
                        "article": "Article 891",
                        "explication": "La capacité peut être affectée par des circonstances telles que la minorité, la tutelle, ou l'interdiction judiciaire."
                      },
                      {
                        "article": "Article 892",
                        "explication": "Les personnes morales exercent leur capacité juridique par l'intermédiaire de leurs représentants légaux."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre II : Les personnes physiques",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Naissance et état civil",
                    "articles": [
                      {
                        "article": "Article 893",
                        "explication": "La naissance confère automatiquement la personnalité juridique à l'enfant."
                      },
                      {
                        "article": "Article 894",
                        "explication": "L'état civil comprend les informations relatives à l'identité d'une personne (nom, prénom, date de naissance, etc.)."
                      },
                      {
                        "article": "Article 895",
                        "explication": "L'état civil est établi par un acte officiel (acte de naissance, jugement supplétif si nécessaire)."
                      },
                      {
                        "article": "Article 896",
                        "explication": "Les erreurs dans les actes d'état civil peuvent être corrigées par voie administrative ou judiciaire."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : La nationalité",
                    "articles": [
                      {
                        "article": "Article 897",
                        "explication": "La nationalité détermine l'appartenance d'une personne à un État et ses droits liés à cette appartenance."
                      },
                      {
                        "article": "Article 898",
                        "explication": "La nationalité camerounaise peut être acquise par filiation, naissance sur le territoire, naturalisation, ou mariage."
                      },
                      {
                        "article": "Article 899",
                        "explication": "La perte de la nationalité est régie par la loi et ne peut pas être arbitraire."
                      },
                      {
                        "article": "Article 900",
                        "explication": "Les conflits de nationalité sont tranchés conformément aux traités internationaux et aux lois locales."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 3 : Le nom et le domicile",
                    "articles": [
                      {
                        "article": "Article 901",
                        "explication": "Le nom est un élément essentiel de l'identité juridique d'une personne physique."
                      },
                      {
                        "article": "Article 902",
                        "explication": "Le changement de nom est soumis à une procédure judiciaire et doit être justifié."
                      },
                      {
                        "article": "Article 903",
                        "explication": "Le domicile est le lieu où une personne a son principal établissement ou réside habituellement."
                      },
                      {
                        "article": "Article 904",
                        "explication": "Le domicile légal peut être imposé par la loi (par exemple, pour les mineurs ou les personnes sous tutelle)."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre III : Les personnes morales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Constitution et reconnaissance",
                    "articles": [
                      {
                        "article": "Article 905",
                        "explication": "Les personnes morales sont constituées par la loi ou par un acte volontaire (association, société, fondation)."
                      },
                      {
                        "article": "Article 906",
                        "explication": "La reconnaissance d'une personne morale nécessite son immatriculation au registre compétent."
                      },
                      {
                        "article": "Article 907",
                        "explication": "Les personnes morales doivent respecter les lois sur leur objet social, leur fonctionnement, et leur dissolution."
                      },
                      {
                        "article": "Article 908",
                        "explication": "Les personnes morales peuvent être dissoutes par décision judiciaire ou administrative en cas d'illégalité."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Capacité et responsabilité",
                    "articles": [
                      {
                        "article": "Article 909",
                        "explication": "Les personnes morales ont une capacité juridique limitée à leur objet social."
                      },
                      {
                        "article": "Article 910",
                        "explication": "Les personnes morales peuvent agir en justice à travers leurs représentants légaux."
                      },
                      {
                        "article": "Article 911",
                        "explication": "La responsabilité des personnes morales est engagée pour les actes de leurs organes ou représentants."
                      },
                      {
                        "article": "Article 912",
                        "explication": "Les personnes morales peuvent être sanctionnées pénalement ou administrativement selon la gravité des faits."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre IV : Les incapacités",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Incapacité naturelle",
                    "articles": [
                      {
                        "article": "Article 913",
                        "explication": "L'incapacité naturelle résulte de la minorité, de troubles mentaux, ou de maladies graves."
                      },
                      {
                        "article": "Article 914",
                        "explication": "Les mineurs sont représentés par leurs parents ou tuteurs légaux pour exercer leurs droits."
                      },
                      {
                        "article": "Article 915",
                        "explication": "Les majeurs sous tutelle ou curatelle sont assistés ou représentés dans leurs actes juridiques."
                      },
                      {
                        "article": "Article 916",
                        "explication": "L'incapacité naturelle est levée par la majorité, la guérison, ou une décision judiciaire."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Incapacité légale",
                    "articles": [
                      {
                        "article": "Article 917",
                        "explication": "L'incapacité légale est imposée par la loi pour protéger certaines catégories de personnes."
                      },
                      {
                        "article": "Article 918",
                        "explication": "Les personnes interdites judiciairement perdent certains droits civiques ou patrimoniaux."
                      },
                      {
                        "article": "Article 919",
                        "explication": "L'incapacité légale peut être temporaire ou permanente selon les circonstances."
                      },
                      {
                        "article": "Article 920",
                        "explication": "La levée de l'incapacité légale nécessite une révision judiciaire ou administrative."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre V : Dispositions finales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 921",
                        "explication": "Le présent Livre V entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 922",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 923",
                        "explication": "Les textes subséquents au Livre V doivent être interprétés conformément à ses principes."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Adaptations locales",
                    "articles": [
                      {
                        "article": "Article 924",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      },
                      {
                        "article": "Article 925",
                        "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                      }
                    ]
                  }

                ]
              }
            ]
          },

          {
            "livre": "Livre VI : Du droit de la famille",
            "structure": [
              {
                "titre": "Titre I : Le mariage",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Conditions du mariage",
                    "articles": [
                      {
                        "article": "Article 926",
                        "explication": "Le mariage est un acte juridique par lequel deux personnes s'unissent légalement."
                      },
                      {
                        "article": "Article 927",
                        "explication": "Les futurs époux doivent avoir atteint l'âge légal de mariage (18 ans) ou obtenir une dispense spéciale."
                      },
                      {
                        "article": "Article 928",
                        "explication": "Le consentement libre et éclairé des époux est une condition essentielle à la validité du mariage."
                      },
                      {
                        "article": "Article 929",
                        "explication": "Le mariage est interdit entre personnes ayant des liens de parenté proche ou d'alliance."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Forme et célébration du mariage",
                    "articles": [
                      {
                        "article": "Article 930",
                        "explication": "Le mariage doit être célébré publiquement devant un officier d'état civil compétent."
                      },
                      {
                        "article": "Article 931",
                        "explication": "La célébration religieuse du mariage n'a pas d'effet juridique sans la formalité civile."
                      },
                      {
                        "article": "Article 932",
                        "explication": "Un acte de mariage doit être dressé et inscrit dans les registres d'état civil."
                      },
                      {
                        "article": "Article 933",
                        "explication": "Toute irrégularité dans la forme du mariage peut entraîner son annulation."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre II : Les effets du mariage",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Droits et devoirs des époux",
                    "articles": [
                      {
                        "article": "Article 934",
                        "explication": "Les époux ont des droits et devoirs réciproques, notamment le respect, la fidélité, et le soutien mutuel."
                      },
                      {
                        "article": "Article 935",
                        "explication": "Les époux doivent contribuer aux charges du mariage proportionnellement à leurs ressources."
                      },
                      {
                        "article": "Article 936",
                        "explication": "Chaque époux conserve sa capacité juridique personnelle, sauf exceptions prévues par la loi."
                      },
                      {
                        "article": "Article 937",
                        "explication": "Les biens acquis pendant le mariage sont régis par le régime matrimonial choisi ou appliqué."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Régimes matrimoniaux",
                    "articles": [
                      {
                        "article": "Article 938",
                        "explication": "Les époux peuvent choisir un régime matrimonial avant ou après le mariage (communauté, séparation de biens, etc.)."
                      },
                      {
                        "article": "Article 939",
                        "explication": "En l'absence de choix, le régime légal de communauté réduite aux acquêts s'applique."
                      },
                      {
                        "article": "Article 940",
                        "explication": "Le changement de régime matrimonial nécessite une autorisation judiciaire et doit respecter les droits des tiers."
                      },
                      {
                        "article": "Article 941",
                        "explication": "Les dettes contractées pour les besoins du ménage engagent les deux époux solidairement."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre III : La dissolution du mariage",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Le divorce",
                    "articles": [
                      {
                        "article": "Article 942",
                        "explication": "Le divorce met fin au mariage conformément à la loi et libère les époux de leurs obligations conjugales."
                      },
                      {
                        "article": "Article 943",
                        "explication": "Le divorce peut être demandé par consentement mutuel ou pour des motifs légaux (faute, altération définitive du lien conjugal)."
                      },
                      {
                        "article": "Article 944",
                        "explication": "Le juge fixe les modalités de la séparation, y compris la garde des enfants et le partage des biens."
                      },
                      {
                        "article": "Article 945",
                        "explication": "Les époux divorcés peuvent se remarier après expiration des délais légaux."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : La séparation de corps",
                    "articles": [
                      {
                        "article": "Article 946",
                        "explication": "La séparation de corps maintient le mariage mais suspend les devoirs conjugaux."
                      },
                      {
                        "article": "Article 947",
                        "explication": "La séparation de corps peut être prononcée pour faute ou par consentement mutuel."
                      },
                      {
                        "article": "Article 948",
                        "explication": "Les effets patrimoniaux de la séparation de corps sont similaires à ceux du divorce."
                      },
                      {
                        "article": "Article 949",
                        "explication": "La réconciliation des époux met fin à la séparation de corps."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre IV : La filiation",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Établissement de la filiation",
                    "articles": [
                      {
                        "article": "Article 950",
                        "explication": "La filiation peut être établie par l'acte de naissance ou par reconnaissance volontaire."
                      },
                      {
                        "article": "Article 951",
                        "explication": "En cas de contestation, la filiation peut être établie ou contestée par voie judiciaire."
                      },
                      {
                        "article": "Article 952",
                        "explication": "La filiation adoptive confère les mêmes droits et devoirs qu'une filiation naturelle."
                      },
                      {
                        "article": "Article 953",
                        "explication": "L'enfant né hors mariage a les mêmes droits que l'enfant légitime."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Droits et devoirs des parents et des enfants",
                    "articles": [
                      {
                        "article": "Article 954",
                        "explication": "Les parents ont l'obligation d'élever, d'éduquer, et de soutenir leurs enfants."
                      },
                      {
                        "article": "Article 955",
                        "explication": "Les enfants ont le droit au respect, à l'affection, et à l'éducation de leurs parents."
                      },
                      {
                        "article": "Article 956",
                        "explication": "Les parents exercent l'autorité parentale conjointement, sauf décision judiciaire contraire."
                      },
                      {
                        "article": "Article 957",
                        "explication": "L'autorité parentale cesse à la majorité ou à l'émancipation de l'enfant."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre V : La succession",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Ouverture de la succession",
                    "articles": [
                      {
                        "article": "Article 958",
                        "explication": "La succession s'ouvre au moment du décès et au lieu du dernier domicile du défunt."
                      },
                      {
                        "article": "Article 959",
                        "explication": "Les héritiers succèdent selon les règles légales ou en vertu d'un testament valide."
                      },
                      {
                        "article": "Article 960",
                        "explication": "Le patrimoine du défunt comprend ses biens, dettes, et droits transmissibles."
                      },
                      {
                        "article": "Article 961",
                        "explication": "Les héritiers peuvent accepter ou renoncer à la succession dans un délai légal."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Ordre de succession",
                    "articles": [
                      {
                        "article": "Article 962",
                        "explication": "Les descendants du défunt sont prioritaires dans l'ordre de succession."
                      },
                      {
                        "article": "Article 963",
                        "explication": "En l'absence de descendants, les ascendants et collatéraux proches héritent selon un ordre défini."
                      },
                      {
                        "article": "Article 964",
                        "explication": "Le conjoint survivant bénéficie d'une réserve héréditaire ou d'une quotité légale."
                      },
                      {
                        "article": "Article 965",
                        "explication": "Les donations entre vifs sont prises en compte dans le calcul des parts successorales."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre VI : Dispositions finales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 966",
                        "explication": "Le présent Livre VI entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 967",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 968",
                        "explication": "Les textes subséquents au Livre VI doivent être interprétés conformément à ses principes."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Adaptations locales",
                    "articles": [
                      {
                        "article": "Article 969",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      },
                      {
                        "article": "Article 970",
                        "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                      }
                    ]
                  }
                ]
              }
            ]
          },

          {
            "livre": "Livre VII : Des successions",
            "structure": [
              {
                "titre": "Titre I : Ouverture de la succession",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Causes et effets de l'ouverture",
                    "articles": [
                      {
                        "article": "Article 971",
                        "explication": "La succession s'ouvre au moment du décès de la personne et au lieu de son dernier domicile."
                      },
                      {
                        "article": "Article 972",
                        "explication": "Les biens, droits, et obligations du défunt constituent l'actif successoral."
                      },
                      {
                        "article": "Article 973",
                        "explication": "Les dettes du défunt sont à la charge de la succession et doivent être payées avant le partage."
                      },
                      {
                        "article": "Article 974",
                        "explication": "Les héritiers peuvent accepter ou renoncer à la succession dans un délai légal."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Qualité d'héritier",
                    "articles": [
                      {
                        "article": "Article 975",
                        "explication": "Les héritiers sont les personnes appelées à succéder au défunt selon la loi ou le testament."
                      },
                      {
                        "article": "Article 976",
                        "explication": "Les héritiers peuvent être légaux (par la loi) ou testamentaires (désignés par le défunt)."
                      },
                      {
                        "article": "Article 977",
                        "explication": "Un héritier peut accepter purement et simplement la succession ou sous bénéfice d'inventaire."
                      },
                      {
                        "article": "Article 978",
                        "explication": "La renonciation à la succession doit être expresse et constatée par acte authentique."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre II : L'ordre de succession",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Succession légale",
                    "articles": [
                      {
                        "article": "Article 979",
                        "explication": "En l'absence de testament, la succession est régie par les règles légales de succession."
                      },
                      {
                        "article": "Article 980",
                        "explication": "Les descendants du défunt sont prioritaires dans l'ordre de succession."
                      },
                      {
                        "article": "Article 981",
                        "explication": "En l'absence de descendants, les ascendants et collatéraux proches héritent selon un ordre défini."
                      },
                      {
                        "article": "Article 982",
                        "explication": "Le conjoint survivant bénéficie d'une réserve héréditaire ou d'une quotité légale."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Succession testamentaire",
                    "articles": [
                      {
                        "article": "Article 983",
                        "explication": "Un testament permet au défunt de désigner ses héritiers et de fixer leurs parts respectives."
                      },
                      {
                        "article": "Article 984",
                        "explication": "Le testament peut être olographe, authentique, ou mystique selon sa forme."
                      },
                      {
                        "article": "Article 985",
                        "explication": "Les dispositions testamentaires ne peuvent pas porter atteinte aux droits réservataires des héritiers."
                      },
                      {
                        "article": "Article 986",
                        "explication": "Un testament peut être révoqué ou modifié à tout moment par le testateur."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre III : La réserve héréditaire",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Nature et calcul de la réserve",
                    "articles": [
                      {
                        "article": "Article 987",
                        "explication": "La réserve héréditaire est la part du patrimoine du défunt qui revient obligatoirement aux héritiers réservataires."
                      },
                      {
                        "article": "Article 988",
                        "explication": "Les héritiers réservataires incluent les descendants, le conjoint survivant, et parfois les ascendants."
                      },
                      {
                        "article": "Article 989",
                        "explication": "La réserve est calculée sur la base de l'actif net successoral après déduction des dettes."
                      },
                      {
                        "article": "Article 990",
                        "explication": "Les donations entre vifs sont prises en compte dans le calcul de la réserve héréditaire."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Réduction pour atteinte à la réserve",
                    "articles": [
                      {
                        "article": "Article 991",
                        "explication": "Toute disposition testamentaire ou donation portant atteinte à la réserve est réductible."
                      },
                      {
                        "article": "Article 992",
                        "explication": "Les héritiers réservataires peuvent demander la réduction des libéralités excessives."
                      },
                      {
                        "article": "Article 993",
                        "explication": "La réduction est opérée par priorité sur les donations les plus récentes."
                      },
                      {
                        "article": "Article 994",
                        "explication": "Le juge fixe les modalités de la réduction après examen des droits des parties concernées."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre IV : Le partage des biens",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Conditions et formalités du partage",
                    "articles": [
                      {
                        "article": "Article 995",
                        "explication": "Le partage des biens successoraux est obligatoire pour mettre fin à l'indivision."
                      },
                      {
                        "article": "Article 996",
                        "explication": "Le partage peut être amiable (par accord des héritiers) ou judiciaire (par décision du tribunal)."
                      },
                      {
                        "article": "Article 997",
                        "explication": "Un inventaire des biens successoraux doit être dressé avant le partage."
                      },
                      {
                        "article": "Article 998",
                        "explication": "Les héritiers doivent s'accorder sur la répartition des biens ou soumettre le litige au juge."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Effets du partage",
                    "articles": [
                      {
                        "article": "Article 999",
                        "explication": "Le partage met fin à l'indivision et attribue les biens aux héritiers selon leur part respective."
                      },
                      {
                        "article": "Article 1000",
                        "explication": "Les héritiers supportent les dettes successoriales proportionnellement à leurs parts."
                      },
                      {
                        "article": "Article 1001",
                        "explication": "Le partage peut être contesté en cas d'injustice manifeste ou de fraude."
                      },
                      {
                        "article": "Article 1002",
                        "explication": "Une fois validé, le partage est irrévocable sauf décision judiciaire spécifique."
                      }
                    ]
                  }
                ]
              },
              {
                "titre": "Titre V : Dispositions finales",
                "chapitres": [
                  {
                    "chapitre": "Chapitre 1 : Entrée en vigueur",
                    "articles": [
                      {
                        "article": "Article 1003",
                        "explication": "Le présent Livre VII entre en vigueur à la date de sa publication au Journal officiel."
                      },
                      {
                        "article": "Article 1004",
                        "explication": "Les dispositions antérieures contraires au présent Livre sont abrogées."
                      },
                      {
                        "article": "Article 1005",
                        "explication": "Les textes subséquents au Livre VII doivent être interprétés conformément à ses principes."
                      }
                    ]
                  },
                  {
                    "chapitre": "Chapitre 2 : Adaptations locales",
                    "articles": [
                      {
                        "article": "Article 1006",
                        "explication": "Les coutumes locales sont prises en compte dans l'application des lois, sous réserve des principes fondamentaux."
                      },
                      {
                        "article": "Article 1007",
                        "explication": "Les conflits entre coutumes et lois écrites sont tranchés par les tribunaux en faveur des droits fondamentaux."
                      }
                    ]
                  }
                ]
              }
            ]
          }

        ]
      }
    ]
  }
}       

  
  